<?php

namespace App\Entity;

use Doctrine\ORM\Mapping as ORM;
use Symfony\Bridge\Doctrine\Validator\Constraints\UniqueEntity;

/**
 * @ORM\Entity(repositoryClass="App\Repository\FacilityRepository")
 * @UniqueEntity(
 *     fields={"city", "street", "house"},
 *     errorPath="house",
 *     message="Division already exist",
 *    )
 * @UniqueEntity(
 *     fields={"lmcode"},
 *     errorPath="lmcode",
 *     message="lmcode already exist",
 *    )
 */
class Facility
{
    const COUNTRIES = [
        'RU' => 'Russia',
        'BY' => 'Belarus',
    ];

    /**
     * @ORM\Id()
     * @ORM\GeneratedValue()
     * @ORM\Column(type="integer")
     */
    private $id;

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $name;

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $lmcode;


    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $postCode;

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $country;

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $region;

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $city;

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $streetType;

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $street;

    /**
     * @return mixed
     */
    public function getAddress()
    {
        $address = '';

        switch ($this->country) {
            case 'Russia':
                $country = 'Россия';
                break;
            case 'Belarus':
                $country = 'Белоруссия';
                break;
        }

        $address .= $country;
        $address .= ', ' . $this->city;

        if (isset($this->streetType)) {
            $strType = self::getStreetTypes()["$this->streetType"];
            $address .= ', ' . $strType . ' ';
        } else {
            $strType = '';
        }
        $address .= $this->street . ', ';
        $address .= 'д. ' . $this->house;

        if (isset($this->buildingType)) {
            $buildingType = self::getBuildingTypes()["$this->buildingType"];
            $address .= ', ' . $buildingType . ' ';
        } else {
            $buildingType = '';
        }
        $address .= $this->building;

        if ($this->room) {
            $address .= ', помещение ';
            $address .= $this->room;
        }


        return $address;
    }

    /**
     * @return mixed
     */
    public function getPostCode()
    {
        return $this->postCode;
    }

    /**
     * @param mixed $postCode
     */
    public function setPostCode($postCode): void
    {
        $this->postCode = $postCode;
    }

    /**
     * @return mixed
     */
    public function getCountry()
    {
        return $this->country;
    }

    /**
     * @param mixed $country
     */
    public function setCountry($country): void
    {
        $this->country = $country;
    }

    /**
     * @return mixed
     */
    public function getRegion()
    {
        return $this->region;
    }

    /**
     * @param mixed $region
     */
    public function setRegion($region): void
    {
        $this->region = $region;
    }

    /**
     * @return mixed
     */
    public function getCity()
    {
        return $this->city;
    }

    /**
     * @param mixed $city
     */
    public function setCity($city): void
    {
        $this->city = $city;
    }

    /**
     * @return mixed
     */
    public function getStreet()
    {
        return $this->street;
    }

    /**
     * @param mixed $street
     */
    public function setStreet($street): void
    {
        $this->street = $street;
    }

    /**
     * @return mixed
     */
    public function getStreetType()
    {
        return $this->streetType;
    }

    /**
     * @param mixed $streetType
     */
    public function setStreetType($streetType): void
    {
        $this->streetType = $streetType;
    }

    /**
     * @return mixed
     */
    public function getHouse()
    {
        return $this->house;
    }

    /**
     * @param mixed $house
     */
    public function setHouse($house): void
    {
        $this->house = $house;
    }

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $house;

    /**
     * @ORM\Column(type="string", length=32, nullable=true)
     */
    private $building;

    /**
     * @ORM\Column(type="string", length=32, nullable=true)
     */
    private $room;

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $buildingType;

    /**
     * @ORM\Column(type="string", length=32, nullable=true)
     */
    private $lat;

    /**
     * @ORM\Column(type="string", length=32, nullable=true)
     */
    private $lon;

    /**
     * @ORM\Column(type="string", length=255, nullable=true)
     */
    private $facilityType;

    public static function getFacilityTypes()
    {
        $types = [
            'PUP' => 'PUP',
            'TWH' => 'TWH',
            'Hybrid' => 'Hybrid',
        ];
        return $types;
    }

    public function getId(): ?int
    {
        return $this->id;
    }

    public function getName(): ?string
    {
        return $this->name;
    }

    public function setName(?string $name): self
    {
        $this->name = $name;

        return $this;
    }

    public function getLmcode(): ?string
    {
        return $this->lmcode;
    }

    public function setLmcode(?string $lmcode): self
    {
        $this->lmcode = $lmcode;

        return $this;
    }

    public static function getStreetTypes()
    {
        $streetTypes = [
            'street' => 'Улица',
            'square' => 'Площадь',
            'clearing' => 'Просека',
            'alley' => 'Аллея',
            'boulevard' => 'Бульвар',
            'promenade' => 'Набережная',
            'lane' => 'Переулок',
            'passage' => 'Проезд',
            'avenue' => 'Проспект',
            'deadlock' => 'Тупик',
            'highway' => 'Шоссе',
        ];

        return $streetTypes;
    }

    public static function getRussianCities()
    {
        $cities = [
            0 => ['', ''],
            '1'=>['city'=>'Абаза','region'=>'Республика Хакасия'],
            '2'=>['city'=>'Абакан','region'=>'Республика Хакасия'],
            '3'=>['city'=>'Абдулино','region'=>'Оренбургская область'],
            '4'=>['city'=>'Абинск','region'=>'Краснодарский край'],
            '5'=>['city'=>'Агидель','region'=>'Республика Башкортостан'],
            '6'=>['city'=>'Агрыз','region'=>'Республика Татарстан'],
            '7'=>['city'=>'Адыгейск','region'=>'Республика Адыгея'],
            '8'=>['city'=>'Азнакаево','region'=>'Республика Татарстан'],
            '9'=>['city'=>'Азов','region'=>'Ростовская область'],
            '10'=>['city'=>'Ак-Довурак','region'=>'Республика Тыва'],
            '11'=>['city'=>'Аксай','region'=>'Ростовская область'],
            '12'=>['city'=>'Аксубаево (ПГТ)','region'=>'Республика Татарстан'],
            '13'=>['city'=>'Актюбинский (ПГТ)','region'=>'Республика Татарстан'],
            '14'=>['city'=>'Алагир','region'=>'Республика Северная Осетия - Алания'],
            '15'=>['city'=>'Алапаевск','region'=>'Свердловская область'],
            '16'=>['city'=>'Алатырь','region'=>'Чувашская Республика'],
            '17'=>['city'=>'Алдан','region'=>'Республика Саха (Якутия)'],
            '18'=>['city'=>'Алейск','region'=>'Алтайский край'],
            '19'=>['city'=>'Александров','region'=>'Владимирская область'],
            '20'=>['city'=>'Александровск','region'=>'Пермский край'],
            '21'=>['city'=>'Александровск-Сахалинский','region'=>'Сахалинская область'],
            '22'=>['city'=>'Алексеевка','region'=>'Белгородская область'],
            '23'=>['city'=>'Алексеевское (ПГТ)','region'=>'Республика Татарстан'],
            '24'=>['city'=>'Алексин','region'=>'Тульская область'],
            '25'=>['city'=>'Алзамай','region'=>'Иркутская область'],
            '26'=>['city'=>'Али-Бердуковский','region'=>'Республика Карачаево-Черкессия'],
            '27'=>['city'=>'Алтухово','region'=>'Брянская область'],
            '28'=>['city'=>'Алупка','region'=>'Автономная Республика Крым'],
            '29'=>['city'=>'Алушта','region'=>'Автономная Республика Крым'],
            '30'=>['city'=>'Альметьевск','region'=>'Республика Татарстан'],
            '31'=>['city'=>'Амурск','region'=>'Хабаровский край'],
            '32'=>['city'=>'Анадырь','region'=>'Чукотский автономный округ'],
            '33'=>['city'=>'Анапа','region'=>'Краснодарский край'],
            '34'=>['city'=>'Ангарск','region'=>'Иркутская область'],
            '35'=>['city'=>'Андреаполь','region'=>'Тверская область'],
            '36'=>['city'=>'Анжеро-Судженск','region'=>'Кемеровская область'],
            '37'=>['city'=>'Анива','region'=>'Сахалинская область'],
            '38'=>['city'=>'Апастово (ПГТ)','region'=>'Республика Татарстан'],
            '39'=>['city'=>'Апатиты','region'=>'Мурманская область'],
            '40'=>['city'=>'Апрелевка','region'=>'Московская область'],
            '41'=>['city'=>'Апшеронск','region'=>'Краснодарский край'],
            '42'=>['city'=>'Арамиль','region'=>'Свердловская область'],
            '43'=>['city'=>'Аргун','region'=>'Чеченская Республика'],
            '44'=>['city'=>'Ардатов','region'=>'Республика Мордовия'],
            '45'=>['city'=>'Ардон','region'=>'Республика Северная Осетия - Алания'],
            '46'=>['city'=>'Арзамас','region'=>'Нижегородская область'],
            '47'=>['city'=>'Аркадак','region'=>'Саратовская область'],
            '48'=>['city'=>'Армавир','region'=>'Краснодарский край'],
            '49'=>['city'=>'Армянск','region'=>'Автономная Республика Крым'],
            '50'=>['city'=>'Арсеньев','region'=>'Приморский край'],
            '51'=>['city'=>'Арск','region'=>'Республика Татарстан'],
            '52'=>['city'=>'Артём','region'=>'Приморский край'],
            '53'=>['city'=>'Артёмовск','region'=>'Красноярский край'],
            '54'=>['city'=>'Артёмовский','region'=>'Свердловская область'],
            '55'=>['city'=>'Архангельск','region'=>'Архангельская область'],
            '56'=>['city'=>'Архонская','region'=>'Республика Северная Осетия - Алания'],
            '57'=>['city'=>'Асбест','region'=>'Свердловская область'],
            '58'=>['city'=>'Асино','region'=>'Томская область'],
            '59'=>['city'=>'Астрахань','region'=>'Астраханская область'],
            '60'=>['city'=>'Аткарск','region'=>'Саратовская область'],
            '61'=>['city'=>'Ахтубинск','region'=>'Астраханская область'],
            '62'=>['city'=>'Ачинск','region'=>'Красноярский край'],
            '63'=>['city'=>'Аша','region'=>'Челябинская область'],
            '64'=>['city'=>'Бабаево','region'=>'Вологодская область'],
            '65'=>['city'=>'Бабушкин','region'=>'Ресупблика Бурятия'],
            '66'=>['city'=>'Бавлы','region'=>'Республика Татарстан'],
            '67'=>['city'=>'Багратионовск','region'=>'Калининградская область'],
            '68'=>['city'=>'Байкальск','region'=>'Иркутская область'],
            '69'=>['city'=>'Баймак','region'=>'Республика Башкортостан'],
            '70'=>['city'=>'Бакал','region'=>'Челябинская область'],
            '71'=>['city'=>'Баксан','region'=>'Кабардино-Балкарская Республика'],
            '72'=>['city'=>'Балабаново','region'=>'Калужская область'],
            '73'=>['city'=>'Балаково','region'=>'Саратовская область'],
            '74'=>['city'=>'Балахна','region'=>'Нижегородская область'],
            '75'=>['city'=>'Балашиха','region'=>'Московская область'],
            '76'=>['city'=>'Балашов','region'=>'Саратовская область'],
            '77'=>['city'=>'Балей','region'=>'Забайкальский край'],
            '78'=>['city'=>'Балтаси (ПГТ)','region'=>'Республика Татарстан'],
            '79'=>['city'=>'Балтийск','region'=>'Калининградская область'],
            '80'=>['city'=>'Барабинск','region'=>'Новосибирская область'],
            '81'=>['city'=>'Барнаул','region'=>'Алтайский край'],
            '82'=>['city'=>'Барыш','region'=>'Ульяновская область'],
            '83'=>['city'=>'Батайск','region'=>'Ростовская область'],
            '84'=>['city'=>'Бахчисарай','region'=>'Автономная Республика Крым'],
            '85'=>['city'=>'Башмаково (ПГТ)','region'=>'Пензенская область'],
            '86'=>['city'=>'Бежаницы','region'=>'Псковская область'],
            '87'=>['city'=>'Бежецк','region'=>'Тверская область'],
            '88'=>['city'=>'Беково (ПГТ)','region'=>'Пензенская область'],
            '89'=>['city'=>'Белая Берёзка','region'=>'Брянская область'],
            '90'=>['city'=>'Белая Калитва','region'=>'Ростовская область'],
            '91'=>['city'=>'Белая Холуница','region'=>'Кировская область'],
            '92'=>['city'=>'Белгород','region'=>'Белгородская область'],
            '93'=>['city'=>'Белебей','region'=>'Республика Башкортостан'],
            '94'=>['city'=>'Белёв','region'=>'Тульская область'],
            '95'=>['city'=>'Белинский','region'=>'Пензенская область'],
            '96'=>['city'=>'Белово','region'=>'Кемеровская область'],
            '97'=>['city'=>'Белогорск','region'=>'Амурская область'],
            '98'=>['city'=>'Белогорск','region'=>'Автономная Республика Крым'],
            '99'=>['city'=>'Белозерск','region'=>'Вологодская область'],
            '100'=>['city'=>'Белокуриха','region'=>'Алтайский край'],
            '101'=>['city'=>'Беломорск','region'=>'Республика Карелия'],
            '102'=>['city'=>'Белорецк','region'=>'Республика Башкортостан'],
            '103'=>['city'=>'Белореченск','region'=>'Краснодарский край'],
            '104'=>['city'=>'Белоусово','region'=>'Калужская область'],
            '105'=>['city'=>'Белоярский','region'=>'ХМАО ЮГРА'],
            '106'=>['city'=>'Белушья Губа','region'=>'Архангельская область'],
            '107'=>['city'=>'Белые Берега','region'=>'Брянская область'],
            '108'=>['city'=>'Белый','region'=>'Тверская область'],
            '109'=>['city'=>'Бердск','region'=>'Новосибирская область'],
            '110'=>['city'=>'Березник','region'=>'Архангельская область'],
            '111'=>['city'=>'Березники','region'=>'Пермский край'],
            '112'=>['city'=>'Берёзовский','region'=>'Кемеровская область'],
            '113'=>['city'=>'Берёзовский','region'=>'Свердловская область'],
            '114'=>['city'=>'Беслан','region'=>'Республика Северная Осетия - Алания'],
            '115'=>['city'=>'Бийск','region'=>'Алтайский край'],
            '116'=>['city'=>'Бикин','region'=>'Хабаровский край'],
            '117'=>['city'=>'Билибино','region'=>'Чукотский автономный округ'],
            '118'=>['city'=>'Биробиджан','region'=>'Еврейская автономная область'],
            '119'=>['city'=>'Бирск','region'=>'Республика Башкортостан'],
            '120'=>['city'=>'Бирюсинск','region'=>'Иркутская область'],
            '121'=>['city'=>'Бирюч','region'=>'Белгородская область'],
            '122'=>['city'=>'Благовещенск','region'=>'Республика Башкортостан'],
            '123'=>['city'=>'Благовещенск','region'=>'Амурская область'],
            '124'=>['city'=>'Благодарный','region'=>'Ставропольский край'],
            '125'=>['city'=>'Бобров','region'=>'Воронежская область'],
            '126'=>['city'=>'Богатые Сабы (ПГТ)','region'=>'Республика Татарстан'],
            '127'=>['city'=>'Богданович','region'=>'Свердловская область'],
            '128'=>['city'=>'Богородицк','region'=>'Тульская область'],
            '129'=>['city'=>'Богородск','region'=>'Нижегородская область'],
            '130'=>['city'=>'Боготол','region'=>'Красноярский край'],
            '131'=>['city'=>'Богучар','region'=>'Воронежская область'],
            '132'=>['city'=>'Бодайбо','region'=>'Иркутская область'],
            '133'=>['city'=>'Бокситогорск','region'=>'Ленинградская область'],
            '134'=>['city'=>'Болгар','region'=>'Республика Татарстан'],
            '135'=>['city'=>'Бологое','region'=>'Тверская область'],
            '136'=>['city'=>'Болотное','region'=>'Новосибирская область'],
            '137'=>['city'=>'Болохово','region'=>'Тульская область'],
            '138'=>['city'=>'Болхов','region'=>'Орловская область'],
            '139'=>['city'=>'Большое Полпино','region'=>'Брянская область'],
            '140'=>['city'=>'Большой Камень','region'=>'Приморский край'],
            '141'=>['city'=>'Бор','region'=>'Нижегородская область'],
            '142'=>['city'=>'Борзя','region'=>'Забайкальский край'],
            '143'=>['city'=>'Борисоглебск','region'=>'Воронежская область'],
            '144'=>['city'=>'Боровичи','region'=>'Новгородская область'],
            '145'=>['city'=>'Боровск','region'=>'Калужская область'],
            '146'=>['city'=>'Бородино','region'=>'Красноярский край'],
            '147'=>['city'=>'Братск','region'=>'Иркутская область'],
            '148'=>['city'=>'Бронницы','region'=>'Московская область'],
            '149'=>['city'=>'Брянск','region'=>'Брянская область'],
            '150'=>['city'=>'Бугульма','region'=>'Республика Татарстан'],
            '151'=>['city'=>'Бугуруслан','region'=>'Оренбургская область'],
            '152'=>['city'=>'Будённовск','region'=>'Ставропольский край'],
            '153'=>['city'=>'Бузулук','region'=>'Оренбургская область'],
            '154'=>['city'=>'Буинск','region'=>'Республика Татарстан'],
            '155'=>['city'=>'Буй','region'=>'Костромская область'],
            '156'=>['city'=>'Буйнакск','region'=>'Республика Дагестан'],
            '157'=>['city'=>'Бутурлиновка','region'=>'Воронежская область'],
            '158'=>['city'=>'Быково','region'=>'Московская область'],
            '159'=>['city'=>'Бытошь','region'=>'Брянская область'],
            '160'=>['city'=>'Валдай','region'=>'Новгородская область'],
            '161'=>['city'=>'Валуйки','region'=>'Белгородская область'],
            '162'=>['city'=>'Васильево (ПГТ)','region'=>'Республика Татарстан'],
            '163'=>['city'=>'Велиж','region'=>'Смоленская область'],
            '164'=>['city'=>'Великие Луки','region'=>'Псковская область'],
            '165'=>['city'=>'Великий Новгород','region'=>'Новгородская область'],
            '166'=>['city'=>'Великий Устюг','region'=>'Вологодская область'],
            '167'=>['city'=>'Вельск','region'=>'Архангельская область'],
            '168'=>['city'=>'Венёв','region'=>'Тульская область'],
            '169'=>['city'=>'Верещагино','region'=>'Пермский край'],
            '170'=>['city'=>'Верея','region'=>'Московская область'],
            '171'=>['city'=>'Верхнеднепровский (ПГТ)','region'=>'Смоленская область'],
            '172'=>['city'=>'Верхнеуральск','region'=>'Челябинская область'],
            '173'=>['city'=>'Верхний Тагил','region'=>'Свердловская область'],
            '174'=>['city'=>'Верхний Уфалей','region'=>'Челябинская область'],
            '175'=>['city'=>'Верхняя Пышма','region'=>'Свердловская область'],
            '176'=>['city'=>'Верхняя Салда','region'=>'Свердловская область'],
            '177'=>['city'=>'Верхняя Тура','region'=>'Свердловская область'],
            '178'=>['city'=>'Верхозим (ПГТ)','region'=>'Пензенская область'],
            '179'=>['city'=>'Верхотурье','region'=>'Свердловская область'],
            '180'=>['city'=>'Верхоянск','region'=>'Республика Саха (Якутия)'],
            '181'=>['city'=>'Весьегонск','region'=>'Тверская область'],
            '182'=>['city'=>'Ветлуга','region'=>'Нижегородская область'],
            '183'=>['city'=>'Видное','region'=>'Московская область'],
            '184'=>['city'=>'Вилюйск','region'=>'Республика Саха (Якутия)'],
            '185'=>['city'=>'Вилючинск','region'=>'Камчатский край'],
            '186'=>['city'=>'Вихоревка','region'=>'Иркутская область'],
            '187'=>['city'=>'Вичуга','region'=>'Ивановская область'],
            '188'=>['city'=>'Владивосток','region'=>'Приморский край'],
            '189'=>['city'=>'Владикавказ','region'=>'Республика Северная Осетия - Алания'],
            '190'=>['city'=>'Владимир','region'=>'Владимирская область'],
            '191'=>['city'=>'Волгоград','region'=>'Волгоградская область'],
            '192'=>['city'=>'Волгодонск','region'=>'Ростовская область'],
            '193'=>['city'=>'Волгореченск','region'=>'Костромская область'],
            '194'=>['city'=>'Волжск','region'=>'Республика Марий Эл'],
            '195'=>['city'=>'Волжский','region'=>'Волгоградская область'],
            '196'=>['city'=>'Вологда','region'=>'Вологодская область'],
            '197'=>['city'=>'Володарск','region'=>'Нижегородская область'],
            '198'=>['city'=>'Волоколамск','region'=>'Московская область'],
            '199'=>['city'=>'Волосово','region'=>'Ленинградская область'],
            '200'=>['city'=>'Волхов','region'=>'Ленинградская область'],
            '201'=>['city'=>'Волчанск','region'=>'Свердловская область'],
            '202'=>['city'=>'Вольск','region'=>'Саратовская область'],
            '203'=>['city'=>'Воркута','region'=>'Республика Коми'],
            '204'=>['city'=>'Воронеж','region'=>'Воронежская область'],
            '205'=>['city'=>'Ворсма','region'=>'Нижегородская область'],
            '206'=>['city'=>'Воскресенск','region'=>'Московская область'],
            '207'=>['city'=>'Воткинск','region'=>'Удмуртская Республика'],
            '208'=>['city'=>'Всеволожск','region'=>'Ленинградская область'],
            '209'=>['city'=>'Вуктыл','region'=>'Республика Коми'],
            '210'=>['city'=>'Выборг','region'=>'Ленинградская область'],
            '211'=>['city'=>'Выгоничи','region'=>'Брянская область'],
            '212'=>['city'=>'Выкса','region'=>'Нижегородская область'],
            '213'=>['city'=>'Высоковск','region'=>'Московская область'],
            '214'=>['city'=>'Высоцк','region'=>'Ленинградская область'],
            '215'=>['city'=>'Вытегра','region'=>'Вологодская область'],
            '216'=>['city'=>'Вычегодский','region'=>'Архангельская область'],
            '217'=>['city'=>'Вышков','region'=>'Брянская область'],
            '218'=>['city'=>'Вышний Волочёк','region'=>'Тверская область'],
            '219'=>['city'=>'Вяземский','region'=>'Хабаровский край'],
            '220'=>['city'=>'Вязники','region'=>'Владимирская область'],
            '221'=>['city'=>'Вязьма','region'=>'Смоленская область'],
            '222'=>['city'=>'Вятские Поляны','region'=>'Кировская область'],
            '223'=>['city'=>'Гаврилов Посад','region'=>'Ивановская область'],
            '224'=>['city'=>'Гаврилов-Ям','region'=>'Ярославская область'],
            '225'=>['city'=>'Гагарин','region'=>'Смоленская область'],
            '226'=>['city'=>'Гаджиево','region'=>'Мурманская область'],
            '227'=>['city'=>'Гай','region'=>'Оренбургская область'],
            '228'=>['city'=>'Галич','region'=>'Костромская область'],
            '229'=>['city'=>'Гаспра','region'=>'Автономная Республика Крым'],
            '230'=>['city'=>'Гатчина','region'=>'Ленинградская область'],
            '231'=>['city'=>'Гвардейск','region'=>'Калининградская область'],
            '232'=>['city'=>'Гвардейское','region'=>'Автономная Республика Крым'],
            '233'=>['city'=>'Гдов','region'=>'Псковская область'],
            '234'=>['city'=>'Геленджик','region'=>'Краснодарский край'],
            '235'=>['city'=>'Георгиевск','region'=>'Ставропольский край'],
            '236'=>['city'=>'Гизель','region'=>'Республика Северная Осетия - Алания'],
            '237'=>['city'=>'Глазов','region'=>'Удмуртская Республика'],
            '238'=>['city'=>'Голицыно','region'=>'Московская область'],
            '239'=>['city'=>'Голынки (ПГТ)','region'=>'Смоленская область'],
            '240'=>['city'=>'Горагорск (ПГТ)','region'=>'Чеченская Республика'],
            '241'=>['city'=>'Горбатов','region'=>'Нижегородская область'],
            '242'=>['city'=>'Горно-Алтайск','region'=>'Ресупблика Алтай'],
            '243'=>['city'=>'Горнозаводск','region'=>'Пермский край'],
            '244'=>['city'=>'Горняк','region'=>'Алтайский край'],
            '245'=>['city'=>'Городец','region'=>'Нижегородская область'],
            '246'=>['city'=>'Городище','region'=>'Пензенская область'],
            '247'=>['city'=>'Городовиковск','region'=>'Республика Калмыкия'],
            '248'=>['city'=>'Гороховец','region'=>'Владимирская область'],
            '249'=>['city'=>'Горячий Ключ','region'=>'Краснодарский край'],
            '250'=>['city'=>'Грайворон','region'=>'Белгородская область'],
            '251'=>['city'=>'Гремячинск','region'=>'Пермский край'],
            '252'=>['city'=>'Грозный','region'=>'Чеченская Республика'],
            '253'=>['city'=>'Грязи','region'=>'Липецкая область'],
            '254'=>['city'=>'Грязовец','region'=>'Вологодская область'],
            '255'=>['city'=>'Губаха','region'=>'Пермский край'],
            '256'=>['city'=>'Губкин','region'=>'Белгородская область'],
            '257'=>['city'=>'Губкинский','region'=>'Ямало-Ненецкий автономный округ'],
            '258'=>['city'=>'Гудермес','region'=>'Чеченская Республика'],
            '259'=>['city'=>'Гуково','region'=>'Ростовская область'],
            '260'=>['city'=>'Гулькевичи','region'=>'Краснодарский край'],
            '261'=>['city'=>'Гурьевск','region'=>'Калининградская область'],
            '262'=>['city'=>'Гурьевск','region'=>'Кемеровская область'],
            '263'=>['city'=>'Гусев','region'=>'Калининградская область'],
            '264'=>['city'=>'Гусиноозёрск','region'=>'Ресупблика Бурятия'],
            '265'=>['city'=>'Гусь-Хрустальный','region'=>'Владимирская область'],
            '266'=>['city'=>'Давлеканово','region'=>'Республика Башкортостан'],
            '267'=>['city'=>'Дагестанские Огни','region'=>'Республика Дагестан'],
            '268'=>['city'=>'Далматово','region'=>'Курганская область'],
            '269'=>['city'=>'Дальнегорск','region'=>'Приморский край'],
            '270'=>['city'=>'Дальнереченск','region'=>'Приморский край'],
            '271'=>['city'=>'Данилов','region'=>'Ярославская область'],
            '272'=>['city'=>'Данков','region'=>'Липецкая область'],
            '273'=>['city'=>'Дегтярск','region'=>'Свердловская область'],
            '274'=>['city'=>'Дедовичи','region'=>'Псковская область'],
            '275'=>['city'=>'Дедовск','region'=>'Московская область'],
            '276'=>['city'=>'Демидов','region'=>'Смоленская область'],
            '277'=>['city'=>'Дербент','region'=>'Республика Дагестан'],
            '278'=>['city'=>'Десногорск','region'=>'Смоленская область'],
            '279'=>['city'=>'Джалиль (ПГТ)','region'=>'Республика Татарстан'],
            '280'=>['city'=>'Джанкой','region'=>'Автономная Республика Крым'],
            '281'=>['city'=>'Дзержинск','region'=>'Нижегородская область'],
            '282'=>['city'=>'Дзержинский','region'=>'Московская область'],
            '283'=>['city'=>'Дивногорск','region'=>'Красноярский край'],
            '284'=>['city'=>'Дигора','region'=>'Республика Северная Осетия - Алания'],
            '285'=>['city'=>'Димитровград','region'=>'Ульяновская область'],
            '286'=>['city'=>'Дмитриев','region'=>'Курская область'],
            '287'=>['city'=>'Дмитриевка','region'=>'Тамбовская область'],
            '288'=>['city'=>'Дмитров','region'=>'Московская область'],
            '289'=>['city'=>'Дмитровск','region'=>'Орловская область'],
            '290'=>['city'=>'Дно','region'=>'Псковская область'],
            '291'=>['city'=>'Добрянка','region'=>'Пермский край'],
            '292'=>['city'=>'Долгопрудный','region'=>'Московская область'],
            '293'=>['city'=>'Долинск','region'=>'Сахалинская область'],
            '294'=>['city'=>'Домодедово','region'=>'Московская область'],
            '295'=>['city'=>'Донецк','region'=>'Ростовская область'],
            '296'=>['city'=>'Донской','region'=>'Тульская область'],
            '297'=>['city'=>'Дорогобуж','region'=>'Смоленская область'],
            '298'=>['city'=>'Дрезна','region'=>'Московская область'],
            '299'=>['city'=>'Дубна','region'=>'Московская область'],
            '300'=>['city'=>'Дубовка','region'=>'Волгоградская область'],
            '301'=>['city'=>'Дубровка','region'=>'Брянская область'],
            '302'=>['city'=>'Дудинка','region'=>'Красноярский край'],
            '303'=>['city'=>'Духовщина','region'=>'Смоленская область'],
            '304'=>['city'=>'Дюртюли','region'=>'Республика Башкортостан'],
            '305'=>['city'=>'Дятьково','region'=>'Брянская область'],
            '306'=>['city'=>'Евлашево (ПГТ)','region'=>'Пензенская область'],
            '307'=>['city'=>'Евпатория','region'=>'Автономная Республика Крым'],
            '308'=>['city'=>'Егорьевск','region'=>'Московская область'],
            '309'=>['city'=>'Ейск','region'=>'Краснодарский край'],
            '310'=>['city'=>'Екатеринбург','region'=>'Свердловская область'],
            '311'=>['city'=>'Елабуга','region'=>'Республика Татарстан'],
            '312'=>['city'=>'Елец','region'=>'Липецкая область'],
            '313'=>['city'=>'Елизово','region'=>'Камчатский край'],
            '314'=>['city'=>'Ельня','region'=>'Смоленская область'],
            '315'=>['city'=>'Еманжелинск','region'=>'Челябинская область'],
            '316'=>['city'=>'Емва','region'=>'Республика Коми'],
            '317'=>['city'=>'Емца','region'=>'Архангельская область'],
            '318'=>['city'=>'Енисейск','region'=>'Красноярский край'],
            '319'=>['city'=>'Ермолино','region'=>'Калужская область'],
            '320'=>['city'=>'Ершов','region'=>'Саратовская область'],
            '321'=>['city'=>'Ессентуки','region'=>'Ставропольский край'],
            '322'=>['city'=>'Ефремов','region'=>'Тульская область'],
            '323'=>['city'=>'Железноводск','region'=>'Ставропольский край'],
            '324'=>['city'=>'Железногорск','region'=>'Красноярский край'],
            '325'=>['city'=>'Железногорск','region'=>'Курская область'],
            '326'=>['city'=>'Железногорск-Илимский','region'=>'Иркутская область'],
            '327'=>['city'=>'Железнодорожный','region'=>'Московская область'],
            '328'=>['city'=>'Жердевка','region'=>'Тамбовская область'],
            '329'=>['city'=>'Жигулёвск','region'=>'Самарская область'],
            '330'=>['city'=>'Жиздра','region'=>'Калужская область'],
            '331'=>['city'=>'Жирновск','region'=>'Волгоградская область'],
            '332'=>['city'=>'Жуков','region'=>'Калужская область'],
            '333'=>['city'=>'Жуковка','region'=>'Брянская область'],
            '334'=>['city'=>'Жуковский','region'=>'Московская область'],
            '335'=>['city'=>'Завитинск','region'=>'Амурская область'],
            '336'=>['city'=>'Заводоуковск','region'=>'Тюменская область'],
            '337'=>['city'=>'Заводской','region'=>'Республика Северная Осетия - Алания'],
            '338'=>['city'=>'Заволжск','region'=>'Ивановская область'],
            '339'=>['city'=>'Заволжье','region'=>'Нижегородская область'],
            '340'=>['city'=>'Задонск','region'=>'Липецкая область'],
            '341'=>['city'=>'Заинск','region'=>'Республика Татарстан'],
            '342'=>['city'=>'Закаменск','region'=>'Ресупблика Бурятия'],
            '343'=>['city'=>'Заозёрный','region'=>'Красноярский край'],
            '344'=>['city'=>'Заозёрск','region'=>'Мурманская область'],
            '345'=>['city'=>'Западная Двина','region'=>'Тверская область'],
            '346'=>['city'=>'Заплюсье','region'=>'Псковская область'],
            '347'=>['city'=>'Заполярный','region'=>'Мурманская область'],
            '348'=>['city'=>'Зарайск','region'=>'Московская область'],
            '349'=>['city'=>'Заречный','region'=>'Пензенская область'],
            '350'=>['city'=>'Заречный','region'=>'Свердловская область'],
            '351'=>['city'=>'Заринск','region'=>'Алтайский край'],
            '352'=>['city'=>'Звенигово','region'=>'Республика Марий Эл'],
            '353'=>['city'=>'Звенигород','region'=>'Московская область'],
            '354'=>['city'=>'Зверево','region'=>'Ростовская область'],
            '355'=>['city'=>'Зеленогорск','region'=>'Красноярский край'],
            '356'=>['city'=>'Зеленоград','region'=>'Московская область'],
            '357'=>['city'=>'Зеленоградск','region'=>'Калининградская область'],
            '358'=>['city'=>'Зеленодольск','region'=>'Республика Татарстан'],
            '359'=>['city'=>'Зеленокумск','region'=>'Ставропольский край'],
            '360'=>['city'=>'Зеленчукская','region'=>'Республика Карачаево-Черкессия'],
            '361'=>['city'=>'Земетчино (ПГТ)','region'=>'Пензенская область'],
            '362'=>['city'=>'Зерноград','region'=>'Ростовская область'],
            '363'=>['city'=>'Зея','region'=>'Амурская область'],
            '364'=>['city'=>'Зима','region'=>'Иркутская область'],
            '365'=>['city'=>'Златоуст','region'=>'Челябинская область'],
            '366'=>['city'=>'Злынка','region'=>'Брянская область'],
            '367'=>['city'=>'Змеиногорск','region'=>'Алтайский край'],
            '368'=>['city'=>'Змейская','region'=>'Республика Северная Осетия - Алания'],
            '369'=>['city'=>'Знаменка','region'=>'Тамбовская область'],
            '370'=>['city'=>'Знаменск','region'=>'Астраханская область'],
            '371'=>['city'=>'Золотарёвка (ПГТ)','region'=>'Пензенская область'],
            '372'=>['city'=>'Зубцов','region'=>'Тверская область'],
            '373'=>['city'=>'Зуевка','region'=>'Кировская область'],
            '374'=>['city'=>'Ивангород','region'=>'Ленинградская область'],
            '375'=>['city'=>'Иваново','region'=>'Ивановская область'],
            '376'=>['city'=>'Ивантеевка','region'=>'Московская область'],
            '377'=>['city'=>'Ивдель','region'=>'Свердловская область'],
            '378'=>['city'=>'Ивот','region'=>'Брянская область'],
            '379'=>['city'=>'Игарка','region'=>'Красноярский край'],
            '380'=>['city'=>'Идрица','region'=>'Псковская область'],
            '381'=>['city'=>'Ижевск','region'=>'Удмуртская Республика'],
            '382'=>['city'=>'Избербаш','region'=>'Республика Дагестан'],
            '383'=>['city'=>'Изобильный','region'=>'Ставропольский край'],
            '384'=>['city'=>'Иланский','region'=>'Красноярский край'],
            '385'=>['city'=>'Инжавино','region'=>'Тамбовская область'],
            '386'=>['city'=>'Инза','region'=>'Ульяновская область'],
            '387'=>['city'=>'Инкерман','region'=>'Автономная Республика Крым'],
            '388'=>['city'=>'Иннополис','region'=>'Республика Татарстан'],
            '389'=>['city'=>'Инсар','region'=>'Республика Мордовия'],
            '390'=>['city'=>'Инта','region'=>'Республика Коми'],
            '391'=>['city'=>'Ипатово','region'=>'Ставропольский край'],
            '392'=>['city'=>'Ирбит','region'=>'Свердловская область'],
            '393'=>['city'=>'Иркутск','region'=>'Иркутская область'],
            '394'=>['city'=>'Исилькуль','region'=>'Омская область'],
            '395'=>['city'=>'Искитим','region'=>'Новосибирская область'],
            '396'=>['city'=>'Исса (ПГТ)','region'=>'Пензенская область'],
            '397'=>['city'=>'Истра','region'=>'Московская область'],
            '398'=>['city'=>'Ишим','region'=>'Тюменская область'],
            '399'=>['city'=>'Ишимбай','region'=>'Республика Башкортостан'],
            '400'=>['city'=>'Йошкар-Ола','region'=>'Республика Марий Эл'],
            '401'=>['city'=>'Кадников','region'=>'Вологодская область'],
            '402'=>['city'=>'Казань','region'=>'Республика Татарстан'],
            '403'=>['city'=>'Калач','region'=>'Воронежская область'],
            '404'=>['city'=>'Калачинск','region'=>'Омская область'],
            '405'=>['city'=>'Калач-на-Дону','region'=>'Волгоградская область'],
            '406'=>['city'=>'Калининград','region'=>'Калининградская область'],
            '407'=>['city'=>'Калининск','region'=>'Саратовская область'],
            '408'=>['city'=>'Калтан','region'=>'Кемеровская область'],
            '409'=>['city'=>'Калуга','region'=>'Калужская область'],
            '410'=>['city'=>'Калязин','region'=>'Тверская область'],
            '411'=>['city'=>'Камбарка','region'=>'Удмуртская Республика'],
            '412'=>['city'=>'Камбилеевское','region'=>'Республика Северная Осетия - Алания'],
            '413'=>['city'=>'Каменка','region'=>'Архангельская область'],
            '414'=>['city'=>'Каменка','region'=>'Пензенская область'],
            '415'=>['city'=>'Каменногорск','region'=>'Ленинградская область'],
            '416'=>['city'=>'Каменск-Уральский','region'=>'Свердловская область'],
            '417'=>['city'=>'Каменск-Шахтинский','region'=>'Ростовская область'],
            '418'=>['city'=>'Камень-на-Оби','region'=>'Алтайский край'],
            '419'=>['city'=>'Камешково','region'=>'Владимирская область'],
            '420'=>['city'=>'Камские Поляны (ПГТ)','region'=>'Республика Татарстан'],
            '421'=>['city'=>'Камское Устье (ПГТ)','region'=>'Республика Татарстан'],
            '422'=>['city'=>'Камызяк','region'=>'Астраханская область'],
            '423'=>['city'=>'Камышин','region'=>'Волгоградская область'],
            '424'=>['city'=>'Камышлов','region'=>'Свердловская область'],
            '425'=>['city'=>'Канаш','region'=>'Чувашская Республика'],
            '426'=>['city'=>'Кандалакша','region'=>'Мурманская область'],
            '427'=>['city'=>'Канск','region'=>'Красноярский край'],
            '428'=>['city'=>'Карабаново','region'=>'Владимирская область'],
            '429'=>['city'=>'Карабаш','region'=>'Челябинская область'],
            '430'=>['city'=>'Карабаш (ПГТ)','region'=>'Республика Татарстан'],
            '431'=>['city'=>'Карабулак','region'=>'Республика Ингушетия'],
            '432'=>['city'=>'Карасук','region'=>'Новосибирская область'],
            '433'=>['city'=>'Карачаевск','region'=>'Республика Карачаево-Черкессия'],
            '434'=>['city'=>'Карачев','region'=>'Брянская область'],
            '435'=>['city'=>'Каргат','region'=>'Новосибирская область'],
            '436'=>['city'=>'Каргополь','region'=>'Архангельская область'],
            '437'=>['city'=>'Кардоникская','region'=>'Республика Карачаево-Черкессия'],
            '438'=>['city'=>'Кардымово (ПГТ)','region'=>'Смоленская область'],
            '439'=>['city'=>'Карпинск','region'=>'Свердловская область'],
            '440'=>['city'=>'Карталы','region'=>'Челябинская область'],
            '441'=>['city'=>'Касимов','region'=>'Рязанская область'],
            '442'=>['city'=>'Касли','region'=>'Челябинская область'],
            '443'=>['city'=>'Каспийск','region'=>'Республика Дагестан'],
            '444'=>['city'=>'Катав-Ивановск','region'=>'Челябинская область'],
            '445'=>['city'=>'Катайск','region'=>'Курганская область'],
            '446'=>['city'=>'Качканар','region'=>'Свердловская область'],
            '447'=>['city'=>'Кашин','region'=>'Тверская область'],
            '448'=>['city'=>'Кашира','region'=>'Московская область'],
            '449'=>['city'=>'Кедровый','region'=>'Томская область'],
            '450'=>['city'=>'Кемерово','region'=>'Кемеровская область'],
            '451'=>['city'=>'Кемь','region'=>'Республика Карелия'],
            '452'=>['city'=>'Керчь','region'=>'Автономная Республика Крым'],
            '453'=>['city'=>'Кизел','region'=>'Пермский край'],
            '454'=>['city'=>'Кизилюрт','region'=>'Республика Дагестан'],
            '455'=>['city'=>'Кизляр','region'=>'Республика Дагестан'],
            '456'=>['city'=>'Кизляр','region'=>'Республика Северная Осетия - Алания'],
            '457'=>['city'=>'Кимовск','region'=>'Тульская область'],
            '458'=>['city'=>'Кимры','region'=>'Тверская область'],
            '459'=>['city'=>'Кингисепп','region'=>'Ленинградская область'],
            '460'=>['city'=>'Кинель','region'=>'Самарская область'],
            '461'=>['city'=>'Кинешма','region'=>'Ивановская область'],
            '462'=>['city'=>'Киреевск','region'=>'Тульская область'],
            '463'=>['city'=>'Киренск','region'=>'Иркутская область'],
            '464'=>['city'=>'Киржач','region'=>'Владимирская область'],
            '465'=>['city'=>'Кириллов','region'=>'Вологодская область'],
            '466'=>['city'=>'Кириши','region'=>'Ленинградская область'],
            '467'=>['city'=>'Киров','region'=>'Калужская область'],
            '468'=>['city'=>'Киров','region'=>'Кировская область'],
            '469'=>['city'=>'Кировград','region'=>'Свердловская область'],
            '470'=>['city'=>'Кирово-Чепецк','region'=>'Кировская область'],
            '471'=>['city'=>'Кировск','region'=>'Ленинградская область'],
            '472'=>['city'=>'Кировск','region'=>'Мурманская область'],
            '473'=>['city'=>'Кирс','region'=>'Кировская область'],
            '474'=>['city'=>'Кирсанов','region'=>'Тамбовская область'],
            '475'=>['city'=>'Киселёвск','region'=>'Кемеровская область'],
            '476'=>['city'=>'Кисловодск','region'=>'Ставропольский край'],
            '477'=>['city'=>'Клетня','region'=>'Брянская область'],
            '478'=>['city'=>'Климово','region'=>'Брянская область'],
            '479'=>['city'=>'Клин','region'=>'Московская область'],
            '480'=>['city'=>'Клинцы','region'=>'Брянская область'],
            '481'=>['city'=>'Княгинино','region'=>'Нижегородская область'],
            '482'=>['city'=>'Ковдор','region'=>'Мурманская область'],
            '483'=>['city'=>'Ковров','region'=>'Владимирская область'],
            '484'=>['city'=>'Ковылкино','region'=>'Республика Мордовия'],
            '485'=>['city'=>'Когалым','region'=>'ХМАО ЮГРА'],
            '486'=>['city'=>'Кодинск','region'=>'Красноярский край'],
            '487'=>['city'=>'Козельск','region'=>'Калужская область'],
            '488'=>['city'=>'Козловка','region'=>'Чувашская Республика'],
            '489'=>['city'=>'Козьмодемьянск','region'=>'Республика Марий Эл'],
            '490'=>['city'=>'Кокоревка','region'=>'Брянская область'],
            '491'=>['city'=>'Кола','region'=>'Мурманская область'],
            '492'=>['city'=>'Кологрив','region'=>'Костромская область'],
            '493'=>['city'=>'Коломна','region'=>'Московская область'],
            '494'=>['city'=>'Колпашево','region'=>'Томская область'],
            '495'=>['city'=>'Колпино','region'=>'Город Санкт-Петербург'],
            '496'=>['city'=>'Колышлей (ПГТ)','region'=>'Пензенская область'],
            '497'=>['city'=>'Кольчугино','region'=>'Владимирская область'],
            '498'=>['city'=>'Комаричи','region'=>'Брянская область'],
            '499'=>['city'=>'Коммунар','region'=>'Ленинградская область'],
            '500'=>['city'=>'Комсомольск','region'=>'Ивановская область'],
            '501'=>['city'=>'Комсомольск-на-Амуре','region'=>'Хабаровский край'],
            '502'=>['city'=>'Конаково','region'=>'Тверская область'],
            '503'=>['city'=>'Кондопога','region'=>'Республика Карелия'],
            '504'=>['city'=>'Кондрово','region'=>'Калужская область'],
            '505'=>['city'=>'Коноша','region'=>'Архангельская область'],
            '506'=>['city'=>'Константиновск','region'=>'Ростовская область'],
            '507'=>['city'=>'Копейск','region'=>'Челябинская область'],
            '508'=>['city'=>'Кораблино','region'=>'Рязанская область'],
            '509'=>['city'=>'Кореновск','region'=>'Краснодарский край'],
            '510'=>['city'=>'Коркино','region'=>'Челябинская область'],
            '511'=>['city'=>'Королёв','region'=>'Московская область'],
            '512'=>['city'=>'Короча','region'=>'Белгородская область'],
            '513'=>['city'=>'Корсаков','region'=>'Сахалинская область'],
            '514'=>['city'=>'Коряжма','region'=>'Архангельская область'],
            '515'=>['city'=>'Костерёво','region'=>'Владимирская область'],
            '516'=>['city'=>'Костомукша','region'=>'Республика Карелия'],
            '517'=>['city'=>'Кострома','region'=>'Костромская область'],
            '518'=>['city'=>'Котельники','region'=>'Московская область'],
            '519'=>['city'=>'Котельниково','region'=>'Волгоградская область'],
            '520'=>['city'=>'Котельнич','region'=>'Кировская область'],
            '521'=>['city'=>'Котлас','region'=>'Архангельская область'],
            '522'=>['city'=>'Котово','region'=>'Волгоградская область'],
            '523'=>['city'=>'Котовск','region'=>'Тамбовская область'],
            '524'=>['city'=>'Кохма','region'=>'Ивановская область'],
            '525'=>['city'=>'Красавино','region'=>'Вологодская область'],
            '526'=>['city'=>'Красная Гора','region'=>'Брянская область'],
            '527'=>['city'=>'Красная Горбатка (ПГТ)','region'=>'Владимирская область'],
            '528'=>['city'=>'Красноармейск','region'=>'Московская область'],
            '529'=>['city'=>'Красноармейск','region'=>'Саратовская область'],
            '530'=>['city'=>'Красновишерск','region'=>'Пермский край'],
            '531'=>['city'=>'Красногвардейское','region'=>'Автономная Республика Крым'],
            '532'=>['city'=>'Красногородск','region'=>'Псковская область'],
            '533'=>['city'=>'Красногорск','region'=>'Московская область'],
            '534'=>['city'=>'Краснодар','region'=>'Краснодарский край'],
            '535'=>['city'=>'Краснозаводск','region'=>'Московская область'],
            '536'=>['city'=>'Краснознаменск','region'=>'Калининградская область'],
            '537'=>['city'=>'Краснознаменск','region'=>'Московская область'],
            '538'=>['city'=>'Краснокаменск','region'=>'Забайкальский край'],
            '539'=>['city'=>'Краснокамск','region'=>'Пермский край'],
            '540'=>['city'=>'Красноперекопск','region'=>'Автономная Республика Крым'],
            '541'=>['city'=>'Краснослободск','region'=>'Республика Мордовия'],
            '542'=>['city'=>'Краснослободск','region'=>'Волгоградская область'],
            '543'=>['city'=>'Краснотурьинск','region'=>'Свердловская область'],
            '544'=>['city'=>'Красноуральск','region'=>'Свердловская область'],
            '545'=>['city'=>'Красноуфимск','region'=>'Свердловская область'],
            '546'=>['city'=>'Красноярск','region'=>'Красноярский край'],
            '547'=>['city'=>'Красный (ПГТ)','region'=>'Смоленская область'],
            '548'=>['city'=>'Красный Кут','region'=>'Саратовская область'],
            '549'=>['city'=>'Красный Луч','region'=>'Псковская область'],
            '550'=>['city'=>'Красный Сулин','region'=>'Ростовская область'],
            '551'=>['city'=>'Красный Холм','region'=>'Тверская область'],
            '552'=>['city'=>'Кремёнки','region'=>'Калужская область'],
            '553'=>['city'=>'Кропоткин','region'=>'Краснодарский край'],
            '554'=>['city'=>'Крымск','region'=>'Краснодарский край'],
            '555'=>['city'=>'Кстово','region'=>'Нижегородская область'],
            '556'=>['city'=>'Кубинка','region'=>'Московская область'],
            '557'=>['city'=>'Кувандык','region'=>'Оренбургская область'],
            '558'=>['city'=>'Кудрово','region'=>'Ленинградская область'],
            '559'=>['city'=>'Кувшиново','region'=>'Тверская область'],
            '560'=>['city'=>'Кудымкар','region'=>'Пермский край'],
            '561'=>['city'=>'Кузнецк','region'=>'Пензенская область'],
            '562'=>['city'=>'Куйбышев','region'=>'Новосибирская область'],
            '563'=>['city'=>'Куйбышевский Затон (ПГТ)','region'=>'Республика Татарстан'],
            '564'=>['city'=>'Кукмор','region'=>'Республика Татарстан'],
            '565'=>['city'=>'Кулебаки','region'=>'Нижегородская область'],
            '566'=>['city'=>'Кулой','region'=>'Архангельская область'],
            '567'=>['city'=>'Кумертау','region'=>'Республика Башкортостан'],
            '568'=>['city'=>'Кумыш','region'=>'Республика Карачаево-Черкессия'],
            '569'=>['city'=>'Кунгур','region'=>'Пермский край'],
            '570'=>['city'=>'Кунья','region'=>'Псковская область'],
            '571'=>['city'=>'Купино','region'=>'Новосибирская область'],
            '572'=>['city'=>'Курган','region'=>'Курганская область'],
            '573'=>['city'=>'Курганинск','region'=>'Краснодарский край'],
            '574'=>['city'=>'Курджиново','region'=>'Республика Карачаево-Черкессия'],
            '575'=>['city'=>'Курильск','region'=>'Сахалинская область'],
            '576'=>['city'=>'Курлово','region'=>'Владимирская область'],
            '577'=>['city'=>'Куровское','region'=>'Московская область'],
            '578'=>['city'=>'Курск','region'=>'Курская область'],
            '579'=>['city'=>'Куртамыш','region'=>'Курганская область'],
            '580'=>['city'=>'Курчатов','region'=>'Курская область'],
            '581'=>['city'=>'Куса','region'=>'Челябинская область'],
            '582'=>['city'=>'Кушва','region'=>'Свердловская область'],
            '583'=>['city'=>'Кызыл','region'=>'Республика Тыва'],
            '584'=>['city'=>'Кыштым','region'=>'Челябинская область'],
            '585'=>['city'=>'Кяхта','region'=>'Ресупблика Бурятия'],
            '586'=>['city'=>'Лабинск','region'=>'Краснодарский край'],
            '587'=>['city'=>'Лабытнанги','region'=>'Ямало-Ненецкий автономный округ'],
            '588'=>['city'=>'Лагань','region'=>'Республика Калмыкия'],
            '589'=>['city'=>'Ладушкин','region'=>'Калининградская область'],
            '590'=>['city'=>'Лаишево','region'=>'Республика Татарстан'],
            '591'=>['city'=>'Лакинск','region'=>'Владимирская область'],
            '592'=>['city'=>'Лангепас','region'=>'ХМАО ЮГРА'],
            '593'=>['city'=>'Лахденпохья','region'=>'Республика Карелия'],
            '594'=>['city'=>'Лебедянь','region'=>'Липецкая область'],
            '595'=>['city'=>'Лениногорск','region'=>'Республика Татарстан'],
            '596'=>['city'=>'Ленинск','region'=>'Волгоградская область'],
            '597'=>['city'=>'Ленинск-Кузнецкий','region'=>'Кемеровская область'],
            '598'=>['city'=>'Ленск','region'=>'Республика Саха (Якутия)'],
            '599'=>['city'=>'Лермонтов','region'=>'Ставропольский край'],
            '600'=>['city'=>'Лесной','region'=>'Свердловская область'],
            '601'=>['city'=>'Лесозаводск','region'=>'Приморский край'],
            '602'=>['city'=>'Лесосибирск','region'=>'Красноярский край'],
            '603'=>['city'=>'Ливны','region'=>'Орловская область'],
            '604'=>['city'=>'Ликино-Дулёво','region'=>'Московская область'],
            '605'=>['city'=>'Липецк','region'=>'Липецкая область'],
            '606'=>['city'=>'Липки','region'=>'Тульская область'],
            '607'=>['city'=>'Лиски','region'=>'Воронежская область'],
            '608'=>['city'=>'Лихославль','region'=>'Тверская область'],
            '609'=>['city'=>'Лобня','region'=>'Московская область'],
            '610'=>['city'=>'Лодейное Поле','region'=>'Ленинградская область'],
            '611'=>['city'=>'Локня','region'=>'Псковская область'],
            '612'=>['city'=>'Локоть','region'=>'Брянская область'],
            '613'=>['city'=>'Лосино-Петровский','region'=>'Московская область'],
            '614'=>['city'=>'Луга','region'=>'Ленинградская область'],
            '615'=>['city'=>'Луза','region'=>'Кировская область'],
            '616'=>['city'=>'Луковская','region'=>'Республика Северная Осетия - Алания'],
            '617'=>['city'=>'Лукоянов','region'=>'Нижегородская область'],
            '618'=>['city'=>'Лунино (ПГТ)','region'=>'Пензенская область'],
            '619'=>['city'=>'Луховицы','region'=>'Московская область'],
            '620'=>['city'=>'Лысково','region'=>'Нижегородская область'],
            '621'=>['city'=>'Лысьва','region'=>'Пермский край'],
            '622'=>['city'=>'Лыткарино','region'=>'Московская область'],
            '623'=>['city'=>'Льгов','region'=>'Курская область'],
            '624'=>['city'=>'Любань','region'=>'Ленинградская область'],
            '625'=>['city'=>'Люберцы','region'=>'Московская область'],
            '626'=>['city'=>'Любим','region'=>'Ярославская область'],
            '627'=>['city'=>'Любохна','region'=>'Брянская область'],
            '628'=>['city'=>'Людиново','region'=>'Калужская область'],
            '629'=>['city'=>'Лянтор','region'=>'ХМАО ЮГРА'],
            '630'=>['city'=>'Магадан','region'=>'Магаданская область'],
            '631'=>['city'=>'Магас','region'=>'Республика Ингушетия'],
            '632'=>['city'=>'Магнитогорск','region'=>'Челябинская область'],
            '633'=>['city'=>'Майкоп','region'=>'Республика Адыгея'],
            '634'=>['city'=>'Майский','region'=>'Кабардино-Балкарская Республика'],
            '635'=>['city'=>'Майское','region'=>'Республика Северная Осетия - Алания'],
            '636'=>['city'=>'Макаров','region'=>'Сахалинская область'],
            '637'=>['city'=>'Макарьев','region'=>'Костромская область'],
            '638'=>['city'=>'Макушино','region'=>'Курганская область'],
            '639'=>['city'=>'Малая Вишера','region'=>'Новгородская область'],
            '640'=>['city'=>'Малгобек','region'=>'Республика Ингушетия'],
            '641'=>['city'=>'Малмыж','region'=>'Кировская область'],
            '642'=>['city'=>'Малоархангельск','region'=>'Орловская область'],
            '643'=>['city'=>'Малошуйка','region'=>'Архангельская область'],
            '644'=>['city'=>'Малоярославец','region'=>'Калужская область'],
            '645'=>['city'=>'Мамадыш','region'=>'Республика Татарстан'],
            '646'=>['city'=>'Мамоново','region'=>'Калининградская область'],
            '647'=>['city'=>'Мантурово','region'=>'Костромская область'],
            '648'=>['city'=>'Мариинск','region'=>'Кемеровская область'],
            '649'=>['city'=>'Мариинский Посад','region'=>'Чувашская Республика'],
            '650'=>['city'=>'Маркс','region'=>'Саратовская область'],
            '651'=>['city'=>'Махачкала','region'=>'Республика Дагестан'],
            '652'=>['city'=>'Мглин','region'=>'Брянская область'],
            '653'=>['city'=>'Мегион','region'=>'ХМАО ЮГРА'],
            '654'=>['city'=>'Медвежьегорск','region'=>'Республика Карелия'],
            '655'=>['city'=>'Медногорск','region'=>'Оренбургская область'],
            '656'=>['city'=>'Медногорский','region'=>'Республика Карачаево-Черкессия'],
            '657'=>['city'=>'Медынь','region'=>'Калужская область'],
            '658'=>['city'=>'Межгорье','region'=>'Республика Башкортостан'],
            '659'=>['city'=>'Междуреченск','region'=>'Кемеровская область'],
            '660'=>['city'=>'Мезень','region'=>'Архангельская область'],
            '661'=>['city'=>'Меленки','region'=>'Владимирская область'],
            '662'=>['city'=>'Мелеуз','region'=>'Республика Башкортостан'],
            '663'=>['city'=>'Менделеевск','region'=>'Республика Татарстан'],
            '664'=>['city'=>'Мензелинск','region'=>'Республика Татарстан'],
            '665'=>['city'=>'Мещовск','region'=>'Калужская область'],
            '666'=>['city'=>'Миасс','region'=>'Челябинская область'],
            '667'=>['city'=>'Микунь','region'=>'Республика Коми'],
            '668'=>['city'=>'Миллерово','region'=>'Ростовская область'],
            '669'=>['city'=>'Минеральные Воды','region'=>'Ставропольский край'],
            '670'=>['city'=>'Минусинск','region'=>'Красноярский край'],
            '671'=>['city'=>'Миньяр','region'=>'Челябинская область'],
            '672'=>['city'=>'Мирный','region'=>'Республика Саха (Якутия)'],
            '673'=>['city'=>'Мирный','region'=>'Архангельская область'],
            '674'=>['city'=>'Михайлов','region'=>'Рязанская область'],
            '675'=>['city'=>'Михайловка','region'=>'Волгоградская область'],
            '676'=>['city'=>'Михайловск','region'=>'Ставропольский край'],
            '677'=>['city'=>'Михайловск','region'=>'Свердловская область'],
            '678'=>['city'=>'Михайловское','region'=>'Республика Северная Осетия - Алания'],
            '679'=>['city'=>'Мичуринск','region'=>'Тамбовская область'],
            '680'=>['city'=>'Могоча','region'=>'Забайкальский край'],
            '681'=>['city'=>'Можайск','region'=>'Московская область'],
            '682'=>['city'=>'Можга','region'=>'Удмуртская Республика'],
            '683'=>['city'=>'Моздок','region'=>'Республика Северная Осетия - Алания'],
            '684'=>['city'=>'Мокшан (ПГТ)','region'=>'Пензенская область'],
            '685'=>['city'=>'Монастырщина (ПГТ)','region'=>'Смоленская область'],
            '686'=>['city'=>'Мончегорск','region'=>'Мурманская область'],
            '687'=>['city'=>'Мордово','region'=>'Тамбовская область'],
            '688'=>['city'=>'Морозовск','region'=>'Ростовская область'],
            '689'=>['city'=>'Моршанск','region'=>'Тамбовская область'],
            '690'=>['city'=>'Мосальск','region'=>'Калужская область'],
            '691'=>['city'=>'Москва','region'=>'Город Москва'],
            '692'=>['city'=>'Муравленко','region'=>'Ямало-Ненецкий автономный округ'],
            '693'=>['city'=>'Мураши','region'=>'Кировская область'],
            '694'=>['city'=>'Мурино','region'=>'Ленинградская область'],
            '695'=>['city'=>'Мурманск','region'=>'Мурманская область'],
            '696'=>['city'=>'Муром','region'=>'Владимирская область'],
            '697'=>['city'=>'Мучкапский','region'=>'Тамбовская область'],
            '698'=>['city'=>'Мценск','region'=>'Орловская область'],
            '699'=>['city'=>'Мыски','region'=>'Кемеровская область'],
            '700'=>['city'=>'Мытищи','region'=>'Московская область'],
            '701'=>['city'=>'Мышкин','region'=>'Ярославская область'],
            '702'=>['city'=>'Набережные Челны','region'=>'Республика Татарстан'],
            '703'=>['city'=>'Навашино','region'=>'Нижегородская область'],
            '704'=>['city'=>'Навля','region'=>'Брянская область'],
            '705'=>['city'=>'Наволоки','region'=>'Ивановская область'],
            '706'=>['city'=>'Надым','region'=>'Ямало-Ненецкий автономный округ'],
            '707'=>['city'=>'Назарово','region'=>'Красноярский край'],
            '708'=>['city'=>'Назрань','region'=>'Республика Ингушетия'],
            '709'=>['city'=>'Называевск','region'=>'Омская область'],
            '710'=>['city'=>'Нальчик','region'=>'Кабардино-Балкарская Республика'],
            '711'=>['city'=>'Нариманов','region'=>'Астраханская область'],
            '712'=>['city'=>'Наро-Фоминск','region'=>'Московская область'],
            '713'=>['city'=>'Нарткала','region'=>'Кабардино-Балкарская Республика'],
            '714'=>['city'=>'Нарьян-Мар','region'=>'Ненецкий автономный округ'],
            '715'=>['city'=>'Находка','region'=>'Приморский край'],
            '716'=>['city'=>'Невель','region'=>'Псковская область'],
            '717'=>['city'=>'Невельск','region'=>'Сахалинская область'],
            '718'=>['city'=>'Невинномысск','region'=>'Ставропольский край'],
            '719'=>['city'=>'Невьянск','region'=>'Свердловская область'],
            '720'=>['city'=>'Нелидово','region'=>'Тверская область'],
            '721'=>['city'=>'Неман','region'=>'Калининградская область'],
            '722'=>['city'=>'Нерехта','region'=>'Костромская область'],
            '723'=>['city'=>'Нерчинск','region'=>'Забайкальский край'],
            '724'=>['city'=>'Нерюнгри','region'=>'Республика Саха (Якутия)'],
            '725'=>['city'=>'Нестеров','region'=>'Калининградская область'],
            '726'=>['city'=>'Нефтегорск','region'=>'Самарская область'],
            '727'=>['city'=>'Нефтекамск','region'=>'Республика Башкортостан'],
            '728'=>['city'=>'Нефтекумск','region'=>'Ставропольский край'],
            '729'=>['city'=>'Нефтеюганск','region'=>'ХМАО ЮГРА'],
            '730'=>['city'=>'Нея','region'=>'Костромская область'],
            '731'=>['city'=>'Нижневартовск','region'=>'ХМАО ЮГРА'],
            '732'=>['city'=>'Нижнекамск','region'=>'Республика Татарстан'],
            '733'=>['city'=>'Нижнеудинск','region'=>'Иркутская область'],
            '734'=>['city'=>'Нижние Вязовые (ПГТ)','region'=>'Республика Татарстан'],
            '735'=>['city'=>'Нижние Серги','region'=>'Свердловская область'],
            '736'=>['city'=>'Нижний Ломов','region'=>'Пензенская область'],
            '737'=>['city'=>'Нижний Новгород','region'=>'Нижегородская область'],
            '738'=>['city'=>'Нижний Тагил','region'=>'Свердловская область'],
            '739'=>['city'=>'Нижняя Мактама (ПГТ)','region'=>'Республика Татарстан'],
            '740'=>['city'=>'Нижняя Салда','region'=>'Свердловская область'],
            '741'=>['city'=>'Нижняя Тура','region'=>'Свердловская область'],
            '742'=>['city'=>'Николаевск','region'=>'Волгоградская область'],
            '743'=>['city'=>'Николаевск-на-Амуре','region'=>'Хабаровский край'],
            '744'=>['city'=>'Никольск','region'=>'Вологодская область'],
            '745'=>['city'=>'Никольск','region'=>'Пензенская область'],
            '746'=>['city'=>'Никольское','region'=>'Ленинградская область'],
            '747'=>['city'=>'Новая Ладога','region'=>'Ленинградская область'],
            '748'=>['city'=>'Новая Ляда','region'=>'Тамбовская область'],
            '749'=>['city'=>'Новая Ляля','region'=>'Свердловская область'],
            '750'=>['city'=>'Новоалександровск','region'=>'Ставропольский край'],
            '751'=>['city'=>'Новоалтайск','region'=>'Алтайский край'],
            '752'=>['city'=>'Новоаннинский','region'=>'Волгоградская область'],
            '753'=>['city'=>'Нововоронеж','region'=>'Воронежская область'],
            '754'=>['city'=>'Новодвинск','region'=>'Архангельская область'],
            '755'=>['city'=>'Новозыбков','region'=>'Брянская область'],
            '756'=>['city'=>'Новокубанск','region'=>'Краснодарский край'],
            '757'=>['city'=>'Новокузнецк','region'=>'Кемеровская область'],
            '758'=>['city'=>'Новокуйбышевск','region'=>'Самарская область'],
            '759'=>['city'=>'Новомичуринск','region'=>'Рязанская область'],
            '760'=>['city'=>'Новомосковск','region'=>'Тульская область'],
            '761'=>['city'=>'Новопавловск','region'=>'Ставропольский край'],
            '762'=>['city'=>'Новопокровка','region'=>'Тамбовская область'],
            '763'=>['city'=>'Новоржев','region'=>'Псковская область'],
            '764'=>['city'=>'Новороссийск','region'=>'Краснодарский край'],
            '765'=>['city'=>'Новосибирск','region'=>'Новосибирская область'],
            '766'=>['city'=>'Новосиль','region'=>'Орловская область'],
            '767'=>['city'=>'Новосокольники','region'=>'Псковская область'],
            '768'=>['city'=>'Новотроицк','region'=>'Оренбургская область'],
            '769'=>['city'=>'Новоузенск','region'=>'Саратовская область'],
            '770'=>['city'=>'Новоульяновск','region'=>'Ульяновская область'],
            '771'=>['city'=>'Новоуральск','region'=>'Свердловская область'],
            '772'=>['city'=>'Новохопёрск','region'=>'Воронежская область'],
            '773'=>['city'=>'Новочебоксарск','region'=>'Чувашская Республика'],
            '774'=>['city'=>'Новочеркасск','region'=>'Ростовская область'],
            '775'=>['city'=>'Новошахтинск','region'=>'Ростовская область'],
            '776'=>['city'=>'Новый Оскол','region'=>'Белгородская область'],
            '777'=>['city'=>'Новый Уренгой','region'=>'Ямало-Ненецкий автономный округ'],
            '778'=>['city'=>'Ногинск','region'=>'Московская область'],
            '779'=>['city'=>'Ногир','region'=>'Республика Северная Осетия - Алания'],
            '780'=>['city'=>'Нолинск','region'=>'Кировская область'],
            '781'=>['city'=>'Норильск','region'=>'Красноярский край'],
            '782'=>['city'=>'Ноябрьск','region'=>'Ямало-Ненецкий автономный округ'],
            '783'=>['city'=>'Нурлат','region'=>'Республика Татарстан'],
            '784'=>['city'=>'Нытва','region'=>'Пермский край'],
            '785'=>['city'=>'Нюрба','region'=>'Республика Саха (Якутия)'],
            '786'=>['city'=>'Нягань','region'=>'ХМАО ЮГРА'],
            '787'=>['city'=>'Нязепетровск','region'=>'Челябинская область'],
            '788'=>['city'=>'Няндома','region'=>'Архангельская область'],
            '789'=>['city'=>'Облучье','region'=>'Еврейская автономная область'],
            '790'=>['city'=>'Обнинск','region'=>'Калужская область'],
            '791'=>['city'=>'Обозерский','region'=>'Архангельская область'],
            '792'=>['city'=>'Обоянь','region'=>'Курская область'],
            '793'=>['city'=>'Обь','region'=>'Новосибирская область'],
            '794'=>['city'=>'Одинцово','region'=>'Московская область'],
            '795'=>['city'=>'Озёрный (ПГТ)','region'=>'Смоленская область'],
            '796'=>['city'=>'Озёрск','region'=>'Калининградская область'],
            '797'=>['city'=>'Озёрск','region'=>'Челябинская область'],
            '798'=>['city'=>'Озёры','region'=>'Московская область'],
            '799'=>['city'=>'Ойсхара (ПГТ)','region'=>'Чеченская Республика'],
            '800'=>['city'=>'Оксовский','region'=>'Архангельская область'],
            '801'=>['city'=>'Октябрьск','region'=>'Самарская область'],
            '802'=>['city'=>'Октябрьский','region'=>'Республика Башкортостан'],
            '803'=>['city'=>'Октябрьский','region'=>'Архангельская область'],
            '804'=>['city'=>'Октябрьское','region'=>'Республика Северная Осетия - Алания'],
            '805'=>['city'=>'Октябрьское','region'=>'Автономная Республика Крым'],
            '806'=>['city'=>'Окуловка','region'=>'Новгородская область'],
            '807'=>['city'=>'Олёкминск','region'=>'Республика Саха (Якутия)'],
            '808'=>['city'=>'Оленегорск','region'=>'Мурманская область'],
            '809'=>['city'=>'Олонец','region'=>'Республика Карелия'],
            '810'=>['city'=>'Омск','region'=>'Омская область'],
            '811'=>['city'=>'Омутнинск','region'=>'Кировская область'],
            '812'=>['city'=>'Онега','region'=>'Архангельская область'],
            '813'=>['city'=>'Опочка','region'=>'Псковская область'],
            '814'=>['city'=>'Орёл','region'=>'Орловская область'],
            '815'=>['city'=>'Оренбург','region'=>'Оренбургская область'],
            '816'=>['city'=>'Орехово-Зуево','region'=>'Московская область'],
            '817'=>['city'=>'Орлов','region'=>'Кировская область'],
            '818'=>['city'=>'Орск','region'=>'Оренбургская область'],
            '819'=>['city'=>'Оса','region'=>'Пермский край'],
            '820'=>['city'=>'Осинники','region'=>'Кемеровская область'],
            '821'=>['city'=>'Осташков','region'=>'Тверская область'],
            '822'=>['city'=>'Остров','region'=>'Псковская область'],
            '823'=>['city'=>'Островной','region'=>'Мурманская область'],
            '824'=>['city'=>'Острогожск','region'=>'Воронежская область'],
            '825'=>['city'=>'Отрадное','region'=>'Ленинградская область'],
            '826'=>['city'=>'Отрадный','region'=>'Самарская область'],
            '827'=>['city'=>'Оха','region'=>'Сахалинская область'],
            '828'=>['city'=>'Оханск','region'=>'Пермский край'],
            '829'=>['city'=>'Очёр','region'=>'Пермский край'],
            '830'=>['city'=>'Павлово','region'=>'Нижегородская область'],
            '831'=>['city'=>'Павловск','region'=>'Воронежская область'],
            '832'=>['city'=>'Павловский Посад','region'=>'Московская область'],
            '833'=>['city'=>'Павлодольская','region'=>'Республика Северная Осетия - Алания'],
            '834'=>['city'=>'Палкино','region'=>'Псковская область'],
            '835'=>['city'=>'Палласовка','region'=>'Волгоградская область'],
            '836'=>['city'=>'Партизанск','region'=>'Приморский край'],
            '837'=>['city'=>'Пачелма (ПГТ)','region'=>'Пензенская область'],
            '838'=>['city'=>'Певек','region'=>'Чукотский автономный округ'],
            '839'=>['city'=>'Пенза','region'=>'Пензенская область'],
            '840'=>['city'=>'Первомайск','region'=>'Нижегородская область'],
            '841'=>['city'=>'Первомайский','region'=>'Тамбовская область'],
            '842'=>['city'=>'Первомайское','region'=>'Республика Карачаево-Черкессия'],
            '843'=>['city'=>'Первоуральск','region'=>'Свердловская область'],
            '844'=>['city'=>'Перевоз','region'=>'Нижегородская область'],
            '845'=>['city'=>'Пересвет','region'=>'Московская область'],
            '846'=>['city'=>'Переславль-Залесский','region'=>'Ярославская область'],
            '847'=>['city'=>'Пермь','region'=>'Пермский край'],
            '848'=>['city'=>'Пестово','region'=>'Новгородская область'],
            '849'=>['city'=>'Петров Вал','region'=>'Волгоградская область'],
            '850'=>['city'=>'Петровск','region'=>'Саратовская область'],
            '851'=>['city'=>'Петровск-Забайкальский','region'=>'Забайкальский край'],
            '852'=>['city'=>'Петрозаводск','region'=>'Республика Карелия'],
            '853'=>['city'=>'Петропавловск-Камчатский','region'=>'Камчатский край'],
            '854'=>['city'=>'Петухово','region'=>'Курганская область'],
            '855'=>['city'=>'Петушки','region'=>'Владимирская область'],
            '856'=>['city'=>'Печора','region'=>'Республика Коми'],
            '857'=>['city'=>'Печоры','region'=>'Псковская область'],
            '858'=>['city'=>'Пикалёво','region'=>'Ленинградская область'],
            '859'=>['city'=>'Пионерский','region'=>'Калининградская область'],
            '860'=>['city'=>'Питкяранта','region'=>'Республика Карелия'],
            '861'=>['city'=>'Плавск','region'=>'Тульская область'],
            '862'=>['city'=>'Пласт','region'=>'Челябинская область'],
            '863'=>['city'=>'Плёс','region'=>'Ивановская область'],
            '864'=>['city'=>'Плесецк','region'=>'Архангельская область'],
            '865'=>['city'=>'Плюсса','region'=>'Псковская область'],
            '866'=>['city'=>'Поворино','region'=>'Воронежская область'],
            '867'=>['city'=>'Погар','region'=>'Брянская область'],
            '868'=>['city'=>'Подольск','region'=>'Московская область'],
            '869'=>['city'=>'Подпорожье','region'=>'Ленинградская область'],
            '870'=>['city'=>'Покачи','region'=>'ХМАО ЮГРА'],
            '871'=>['city'=>'Покров','region'=>'Владимирская область'],
            '872'=>['city'=>'Покровск','region'=>'Республика Саха (Якутия)'],
            '873'=>['city'=>'Полевской','region'=>'Свердловская область'],
            '874'=>['city'=>'Полесск','region'=>'Калининградская область'],
            '875'=>['city'=>'Полысаево','region'=>'Кемеровская область'],
            '876'=>['city'=>'Полярные Зори','region'=>'Мурманская область'],
            '877'=>['city'=>'Полярный','region'=>'Мурманская область'],
            '878'=>['city'=>'Поронайск','region'=>'Сахалинская область'],
            '879'=>['city'=>'Порхов','region'=>'Псковская область'],
            '880'=>['city'=>'Похвистнево','region'=>'Самарская область'],
            '881'=>['city'=>'Почеп','region'=>'Брянская область'],
            '882'=>['city'=>'Починок','region'=>'Смоленская область'],
            '883'=>['city'=>'Пошехонье','region'=>'Ярославская область'],
            '884'=>['city'=>'Правдинск','region'=>'Калининградская область'],
            '885'=>['city'=>'Преградная','region'=>'Республика Карачаево-Черкессия'],
            '886'=>['city'=>'Пржевальское (ПГТ)','region'=>'Смоленская область'],
            '887'=>['city'=>'Приводино','region'=>'Архангельская область'],
            '888'=>['city'=>'Приволжск','region'=>'Ивановская область'],
            '889'=>['city'=>'Приморск','region'=>'Калининградская область'],
            '890'=>['city'=>'Приморск','region'=>'Ленинградская область'],
            '891'=>['city'=>'Приморский','region'=>'Автономная Республика Крым'],
            '892'=>['city'=>'Приморско-Ахтарск','region'=>'Краснодарский край'],
            '893'=>['city'=>'Приозерск','region'=>'Ленинградская область'],
            '894'=>['city'=>'Прокопьевск','region'=>'Кемеровская область'],
            '895'=>['city'=>'Пролетарск','region'=>'Ростовская область'],
            '896'=>['city'=>'Протвино','region'=>'Московская область'],
            '897'=>['city'=>'Прохладный','region'=>'Кабардино-Балкарская Республика'],
            '898'=>['city'=>'Псков','region'=>'Псковская область'],
            '899'=>['city'=>'Псыж','region'=>'Республика Карачаево-Черкессия'],
            '900'=>['city'=>'Пугачёв','region'=>'Саратовская область'],
            '901'=>['city'=>'Пудож','region'=>'Республика Карелия'],
            '902'=>['city'=>'Пуксоозеро','region'=>'Архангельская область'],
            '903'=>['city'=>'Пустошка','region'=>'Псковская область'],
            '904'=>['city'=>'Пучеж','region'=>'Ивановская область'],
            '905'=>['city'=>'Пушкино','region'=>'Московская область'],
            '906'=>['city'=>'Пушкинские Горы','region'=>'Псковская область'],
            '907'=>['city'=>'Пущино','region'=>'Московская область'],
            '908'=>['city'=>'Пыталово','region'=>'Псковская область'],
            '909'=>['city'=>'Пыть-Ях','region'=>'ХМАО ЮГРА'],
            '910'=>['city'=>'Пятигорск','region'=>'Ставропольский край'],
            '911'=>['city'=>'Радица-Крыловка','region'=>'Брянская область'],
            '912'=>['city'=>'Радужный','region'=>'Владимирская область'],
            '913'=>['city'=>'Радужный','region'=>'ХМАО ЮГРА'],
            '914'=>['city'=>'Райчихинск','region'=>'Амурская область'],
            '915'=>['city'=>'Рамасуха','region'=>'Брянская область'],
            '916'=>['city'=>'Раменское','region'=>'Московская область'],
            '917'=>['city'=>'Рассказово','region'=>'Тамбовская область'],
            '918'=>['city'=>'Ревда','region'=>'Свердловская область'],
            '919'=>['city'=>'Реж','region'=>'Свердловская область'],
            '920'=>['city'=>'Реутов','region'=>'Московская область'],
            '921'=>['city'=>'Ржакса','region'=>'Тамбовская область'],
            '922'=>['city'=>'Ржев','region'=>'Тверская область'],
            '923'=>['city'=>'Рогнедино','region'=>'Брянская область'],
            '924'=>['city'=>'Родники','region'=>'Ивановская область'],
            '925'=>['city'=>'Рославль','region'=>'Смоленская область'],
            '926'=>['city'=>'Россошь','region'=>'Воронежская область'],
            '927'=>['city'=>'Ростов','region'=>'Ярославская область'],
            '928'=>['city'=>'Ростов-на-Дону','region'=>'Ростовская область'],
            '929'=>['city'=>'Рошаль','region'=>'Московская область'],
            '930'=>['city'=>'Ртищево','region'=>'Саратовская область'],
            '931'=>['city'=>'Рубцовск','region'=>'Алтайский край'],
            '932'=>['city'=>'Рудня','region'=>'Смоленская область'],
            '933'=>['city'=>'Руза','region'=>'Московская область'],
            '934'=>['city'=>'Рузаевка','region'=>'Республика Мордовия'],
            '935'=>['city'=>'Рыбинск','region'=>'Ярославская область'],
            '936'=>['city'=>'Рыбная Слобода (ПГТ)','region'=>'Республика Татарстан'],
            '937'=>['city'=>'Рыбное','region'=>'Рязанская область'],
            '938'=>['city'=>'Рыльск','region'=>'Курская область'],
            '939'=>['city'=>'Ряжск','region'=>'Рязанская область'],
            '940'=>['city'=>'Рязань','region'=>'Рязанская область'],
            '941'=>['city'=>'Савинский','region'=>'Архангельская область'],
            '942'=>['city'=>'Саки','region'=>'Автономная Республика Крым'],
            '943'=>['city'=>'Салават','region'=>'Республика Башкортостан'],
            '944'=>['city'=>'Салаир','region'=>'Кемеровская область'],
            '945'=>['city'=>'Салехард','region'=>'Ямало-Ненецкий автономный округ'],
            '946'=>['city'=>'Сальск','region'=>'Ростовская область'],
            '947'=>['city'=>'Самара','region'=>'Самарская область'],
            '948'=>['city'=>'Самодед','region'=>'Архангельская область'],
            '949'=>['city'=>'Санкт-Петербург','region'=>'Город Санкт-Петербург'],
            '950'=>['city'=>'Саранск','region'=>'Республика Мордовия'],
            '951'=>['city'=>'Сарапул','region'=>'Удмуртская Республика'],
            '952'=>['city'=>'Саратов','region'=>'Саратовская область'],
            '953'=>['city'=>'Саров','region'=>'Нижегородская область'],
            '954'=>['city'=>'Сасово','region'=>'Рязанская область'],
            '955'=>['city'=>'Сатка','region'=>'Челябинская область'],
            '956'=>['city'=>'Сафоново','region'=>'Смоленская область'],
            '957'=>['city'=>'Саяногорск','region'=>'Республика Хакасия'],
            '958'=>['city'=>'Саянск','region'=>'Иркутская область'],
            '959'=>['city'=>'Светлогорск','region'=>'Калининградская область'],
            '960'=>['city'=>'Светлоград','region'=>'Ставропольский край'],
            '961'=>['city'=>'Светлый','region'=>'Калининградская область'],
            '962'=>['city'=>'Светогорск','region'=>'Ленинградская область'],
            '963'=>['city'=>'Свирск','region'=>'Иркутская область'],
            '964'=>['city'=>'Свободный','region'=>'Амурская область'],
            '965'=>['city'=>'Себеж','region'=>'Псковская область'],
            '966'=>['city'=>'Севастополь','region'=>'Город Севастополь'],
            '967'=>['city'=>'Северобайкальск','region'=>'Ресупблика Бурятия'],
            '968'=>['city'=>'Северодвинск','region'=>'Архангельская область'],
            '969'=>['city'=>'Северо-Курильск','region'=>'Сахалинская область'],
            '970'=>['city'=>'Североморск','region'=>'Мурманская область'],
            '971'=>['city'=>'Североонежск','region'=>'Архангельская область'],
            '972'=>['city'=>'Североуральск','region'=>'Свердловская область'],
            '973'=>['city'=>'Северск','region'=>'Томская область'],
            '974'=>['city'=>'Севск','region'=>'Брянская область'],
            '975'=>['city'=>'Сегежа','region'=>'Республика Карелия'],
            '976'=>['city'=>'Сельцо','region'=>'Брянская область'],
            '977'=>['city'=>'Семёнов','region'=>'Нижегородская область'],
            '978'=>['city'=>'Семикаракорск','region'=>'Ростовская область'],
            '979'=>['city'=>'Семилуки','region'=>'Воронежская область'],
            '980'=>['city'=>'Сенгилей','region'=>'Ульяновская область'],
            '981'=>['city'=>'Серафимович','region'=>'Волгоградская область'],
            '982'=>['city'=>'Сергач','region'=>'Нижегородская область'],
            '983'=>['city'=>'Сергиев Посад ','region'=>'Московская область'],
            '984'=>['city'=>'Сердобск','region'=>'Пензенская область'],
            '985'=>['city'=>'Серов','region'=>'Свердловская область'],
            '986'=>['city'=>'Серпухов','region'=>'Московская область'],
            '987'=>['city'=>'Сертолово','region'=>'Ленинградская область'],
            '988'=>['city'=>'Сибай','region'=>'Республика Башкортостан'],
            '989'=>['city'=>'Сим','region'=>'Челябинская область'],
            '990'=>['city'=>'Симферополь','region'=>'Автономная Республика Крым'],
            '991'=>['city'=>'Сковородино','region'=>'Амурская область'],
            '992'=>['city'=>'Скопин','region'=>'Рязанская область'],
            '993'=>['city'=>'Славгород','region'=>'Алтайский край'],
            '994'=>['city'=>'Славск','region'=>'Калининградская область'],
            '995'=>['city'=>'Славянск-на-Кубани','region'=>'Краснодарский край'],
            '996'=>['city'=>'Сланцы','region'=>'Ленинградская область'],
            '997'=>['city'=>'Слободской','region'=>'Кировская область'],
            '998'=>['city'=>'Слюдянка','region'=>'Иркутская область'],
            '999'=>['city'=>'Смоленск','region'=>'Смоленская область'],
            '1000'=>['city'=>'Снежинск','region'=>'Челябинская область'],
            '1001'=>['city'=>'Снежногорск','region'=>'Мурманская область'],
            '1002'=>['city'=>'Собинка','region'=>'Владимирская область'],
            '1003'=>['city'=>'Советск','region'=>'Калининградская область'],
            '1004'=>['city'=>'Советск','region'=>'Кировская область'],
            '1005'=>['city'=>'Советск','region'=>'Тульская область'],
            '1006'=>['city'=>'Советская Гавань','region'=>'Хабаровский край'],
            '1007'=>['city'=>'Советский','region'=>'Автономная Республика Крым'],
            '1008'=>['city'=>'Советский','region'=>'ХМАО ЮГРА'],
            '1009'=>['city'=>'Сокол','region'=>'Вологодская область'],
            '1010'=>['city'=>'Солигалич','region'=>'Костромская область'],
            '1011'=>['city'=>'Соликамск','region'=>'Пермский край'],
            '1012'=>['city'=>'Солнечногорск','region'=>'Московская область'],
            '1013'=>['city'=>'Сольвычегодск','region'=>'Архангельская область'],
            '1014'=>['city'=>'Соль-Илецк','region'=>'Оренбургская область'],
            '1015'=>['city'=>'Сольцы','region'=>'Новгородская область'],
            '1016'=>['city'=>'Сорочинск','region'=>'Оренбургская область'],
            '1017'=>['city'=>'Сорск','region'=>'Республика Хакасия'],
            '1018'=>['city'=>'Сортавала','region'=>'Республика Карелия'],
            '1019'=>['city'=>'Сосенский','region'=>'Калужская область'],
            '1020'=>['city'=>'Сосновка','region'=>'Кировская область'],
            '1021'=>['city'=>'Сосновка','region'=>'Тамбовская область'],
            '1022'=>['city'=>'Сосновоборск','region'=>'Красноярский край'],
            '1023'=>['city'=>'Сосновоборск (ПГТ)','region'=>'Пензенская область'],
            '1024'=>['city'=>'Сосновый Бор','region'=>'Ленинградская область'],
            '1025'=>['city'=>'Сосновый Бор','region'=>'Псковская область'],
            '1026'=>['city'=>'Сосногорск','region'=>'Республика Коми'],
            '1027'=>['city'=>'Сочи','region'=>'Краснодарский край'],
            '1028'=>['city'=>'Спас-Деменск','region'=>'Калужская область'],
            '1029'=>['city'=>'Спас-Клепики','region'=>'Рязанская область'],
            '1030'=>['city'=>'Спасск','region'=>'Пензенская область'],
            '1031'=>['city'=>'Спасск-Дальний','region'=>'Приморский край'],
            '1032'=>['city'=>'Спасск-Рязанский','region'=>'Рязанская область'],
            '1033'=>['city'=>'Среднеколымск','region'=>'Республика Саха (Якутия)'],
            '1034'=>['city'=>'Среднеуральск','region'=>'Свердловская область'],
            '1035'=>['city'=>'Сретенск','region'=>'Забайкальский край'],
            '1036'=>['city'=>'Ставрополь','region'=>'Ставропольский край'],
            '1037'=>['city'=>'Старая Купавна','region'=>'Московская область'],
            '1038'=>['city'=>'Старая Русса','region'=>'Новгородская область'],
            '1039'=>['city'=>'Старица','region'=>'Тверская область'],
            '1040'=>['city'=>'Стародуб','region'=>'Брянская область'],
            '1041'=>['city'=>'Старый Крым','region'=>'Автономная Республика Крым'],
            '1042'=>['city'=>'Старый Оскол','region'=>'Белгородская область'],
            '1043'=>['city'=>'Старь','region'=>'Брянская область'],
            '1044'=>['city'=>'Стерлитамак','region'=>'Республика Башкортостан'],
            '1045'=>['city'=>'Сторожевая','region'=>'Республика Карачаево-Черкессия'],
            '1046'=>['city'=>'Стрежевой','region'=>'Томская область'],
            '1047'=>['city'=>'Строитель','region'=>'Белгородская область'],
            '1048'=>['city'=>'Струги Красные','region'=>'Псковская область'],
            '1049'=>['city'=>'Струнино','region'=>'Владимирская область'],
            '1050'=>['city'=>'Ступино','region'=>'Московская область'],
            '1051'=>['city'=>'Суворов','region'=>'Тульская область'],
            '1052'=>['city'=>'Судак','region'=>'Автономная Республика Крым'],
            '1053'=>['city'=>'Суджа','region'=>'Курская область'],
            '1054'=>['city'=>'Судогда','region'=>'Владимирская область'],
            '1055'=>['city'=>'Суздаль','region'=>'Владимирская область'],
            '1056'=>['city'=>'Суземка','region'=>'Брянская область'],
            '1057'=>['city'=>'Сунжа','region'=>'Республика Ингушетия'],
            '1058'=>['city'=>'Сунжа','region'=>'Республика Северная Осетия - Алания'],
            '1059'=>['city'=>'Суоярви','region'=>'Республика Карелия'],
            '1060'=>['city'=>'Сура (ПГТ)','region'=>'Пензенская область'],
            '1061'=>['city'=>'Сураж','region'=>'Брянская область'],
            '1062'=>['city'=>'Сургут','region'=>'ХМАО ЮГРА'],
            '1063'=>['city'=>'Суровикино','region'=>'Волгоградская область'],
            '1064'=>['city'=>'Сурск','region'=>'Пензенская область'],
            '1065'=>['city'=>'Сусуман','region'=>'Магаданская область'],
            '1066'=>['city'=>'Сухиничи','region'=>'Калужская область'],
            '1067'=>['city'=>'Сухой Лог','region'=>'Свердловская область'],
            '1068'=>['city'=>'Сызрань','region'=>'Самарская область'],
            '1069'=>['city'=>'Сыктывкар','region'=>'Республика Коми'],
            '1070'=>['city'=>'Сысерть','region'=>'Свердловская область'],
            '1071'=>['city'=>'Сычёвка','region'=>'Смоленская область'],
            '1072'=>['city'=>'Сясьстрой','region'=>'Ленинградская область'],
            '1073'=>['city'=>'Тавда','region'=>'Свердловская область'],
            '1074'=>['city'=>'Таганрог','region'=>'Ростовская область'],
            '1075'=>['city'=>'Тайга','region'=>'Кемеровская область'],
            '1076'=>['city'=>'Тайшет','region'=>'Иркутская область'],
            '1077'=>['city'=>'Талдом','region'=>'Московская область'],
            '1078'=>['city'=>'Талица','region'=>'Свердловская область'],
            '1079'=>['city'=>'Тамала (ПГТ)','region'=>'Пензенская область'],
            '1080'=>['city'=>'Тамбов','region'=>'Тамбовская область'],
            '1081'=>['city'=>'Тара','region'=>'Омская область'],
            '1082'=>['city'=>'Тарко-Сале','region'=>'Ямало-Ненецкий автономный округ'],
            '1083'=>['city'=>'Таруса','region'=>'Калужская область'],
            '1084'=>['city'=>'Татарск','region'=>'Новосибирская область'],
            '1085'=>['city'=>'Таштагол','region'=>'Кемеровская область'],
            '1086'=>['city'=>'Тверь','region'=>'Тверская область'],
            '1087'=>['city'=>'Теберда','region'=>'Республика Карачаево-Черкессия'],
            '1088'=>['city'=>'Тейково','region'=>'Ивановская область'],
            '1089'=>['city'=>'Темников','region'=>'Республика Мордовия'],
            '1090'=>['city'=>'Темрюк','region'=>'Краснодарский край'],
            '1091'=>['city'=>'Тенишево (ПГТ)','region'=>'Республика Татарстан'],
            '1092'=>['city'=>'Терезе','region'=>'Республика Карачаево-Черкессия'],
            '1093'=>['city'=>'Терек','region'=>'Кабардино-Балкарская Республика'],
            '1094'=>['city'=>'Тетюши','region'=>'Республика Татарстан'],
            '1095'=>['city'=>'Тимашёвск','region'=>'Краснодарский край'],
            '1096'=>['city'=>'Тихвин','region'=>'Ленинградская область'],
            '1097'=>['city'=>'Тихорецк','region'=>'Краснодарский край'],
            '1098'=>['city'=>'Тлюстенхабль (ПГТ)','region'=>'Республика Адыгея'],
            '1099'=>['city'=>'Тобольск','region'=>'Тюменская область'],
            '1100'=>['city'=>'Тогучин','region'=>'Новосибирская область'],
            '1101'=>['city'=>'Токарёвка','region'=>'Тамбовская область'],
            '1102'=>['city'=>'Тольятти','region'=>'Самарская область'],
            '1103'=>['city'=>'Томари','region'=>'Сахалинская область'],
            '1104'=>['city'=>'Томмот','region'=>'Республика Саха (Якутия)'],
            '1105'=>['city'=>'Томск','region'=>'Томская область'],
            '1106'=>['city'=>'Топки','region'=>'Кемеровская область'],
            '1107'=>['city'=>'Торжок','region'=>'Тверская область'],
            '1108'=>['city'=>'Торопец','region'=>'Тверская область'],
            '1109'=>['city'=>'Тосно','region'=>'Ленинградская область'],
            '1110'=>['city'=>'Тотьма','region'=>'Вологодская область'],
            '1111'=>['city'=>'Трёхгорный','region'=>'Челябинская область'],
            '1112'=>['city'=>'Троицк','region'=>'Челябинская область'],
            '1113'=>['city'=>'Трубчевск','region'=>'Брянская область'],
            '1114'=>['city'=>'Туапсе','region'=>'Краснодарский край'],
            '1115'=>['city'=>'Туймазы','region'=>'Республика Башкортостан'],
            '1116'=>['city'=>'Тула','region'=>'Тульская область'],
            '1117'=>['city'=>'Тулун','region'=>'Иркутская область'],
            '1118'=>['city'=>'Туран','region'=>'Республика Тыва'],
            '1119'=>['city'=>'Туринск','region'=>'Свердловская область'],
            '1120'=>['city'=>'Тутаев','region'=>'Ярославская область'],
            '1121'=>['city'=>'Тында','region'=>'Амурская область'],
            '1122'=>['city'=>'Тырныауз','region'=>'Кабардино-Балкарская Республика'],
            '1123'=>['city'=>'Тюкалинск','region'=>'Омская область'],
            '1124'=>['city'=>'Тюмень','region'=>'Тюменская область'],
            '1125'=>['city'=>'Уварово','region'=>'Тамбовская область'],
            '1126'=>['city'=>'Углегорск','region'=>'Сахалинская область'],
            '1127'=>['city'=>'Углич','region'=>'Ярославская область'],
            '1128'=>['city'=>'Удачный','region'=>'Республика Саха (Якутия)'],
            '1129'=>['city'=>'Удомля','region'=>'Тверская область'],
            '1130'=>['city'=>'Ужур','region'=>'Красноярский край'],
            '1131'=>['city'=>'Узловая','region'=>'Тульская область'],
            '1132'=>['city'=>'Улан-Удэ','region'=>'Ресупблика Бурятия'],
            '1133'=>['city'=>'Ульяновск','region'=>'Ульяновская область'],
            '1134'=>['city'=>'Умёт','region'=>'Тамбовская область'],
            '1135'=>['city'=>'Унеча','region'=>'Брянская область'],
            '1136'=>['city'=>'Урай','region'=>'ХМАО ЮГРА'],
            '1137'=>['city'=>'Урдома','region'=>'Архангельская область'],
            '1138'=>['city'=>'Урень','region'=>'Нижегородская область'],
            '1139'=>['city'=>'Уржум','region'=>'Кировская область'],
            '1140'=>['city'=>'Урус-Мартан','region'=>'Чеченская Республика'],
            '1141'=>['city'=>'Уруссу (ПГТ)','region'=>'Республика Татарстан'],
            '1142'=>['city'=>'Урюпинск','region'=>'Волгоградская область'],
            '1143'=>['city'=>'Усвяты','region'=>'Псковская область'],
            '1144'=>['city'=>'Усинск','region'=>'Республика Коми'],
            '1145'=>['city'=>'Усмань','region'=>'Липецкая область'],
            '1146'=>['city'=>'Усолье','region'=>'Пермский край'],
            '1147'=>['city'=>'Усолье-Сибирское','region'=>'Иркутская область'],
            '1148'=>['city'=>'Уссурийск','region'=>'Приморский край'],
            '1149'=>['city'=>'Усть-Абакан (ПГТ)','region'=>'Республика Хакасия'],
            '1150'=>['city'=>'Усть-Джегута','region'=>'Республика Карачаево-Черкессия'],
            '1151'=>['city'=>'Усть-Илимск','region'=>'Иркутская область'],
            '1152'=>['city'=>'Усть-Катав','region'=>'Челябинская область'],
            '1153'=>['city'=>'Усть-Кут','region'=>'Иркутская область'],
            '1154'=>['city'=>'Усть-Лабинск','region'=>'Краснодарский край'],
            '1155'=>['city'=>'Устюжна','region'=>'Вологодская область'],
            '1156'=>['city'=>'Уфа','region'=>'Республика Башкортостан'],
            '1157'=>['city'=>'Ухта','region'=>'Республика Коми'],
            '1158'=>['city'=>'Учалы','region'=>'Республика Башкортостан'],
            '1159'=>['city'=>'Учкекен','region'=>'Республика Карачаево-Черкессия'],
            '1160'=>['city'=>'Уяр','region'=>'Красноярский край'],
            '1161'=>['city'=>'Фатеж','region'=>'Курская область'],
            '1162'=>['city'=>'Феодосия','region'=>'Автономная Республика Крым'],
            '1163'=>['city'=>'Фокино','region'=>'Приморский край'],
            '1164'=>['city'=>'Фокино','region'=>'Брянская область'],
            '1165'=>['city'=>'Фролово','region'=>'Волгоградская область'],
            '1166'=>['city'=>'Фрязино','region'=>'Московская область'],
            '1167'=>['city'=>'Фурманов','region'=>'Ивановская область'],
            '1168'=>['city'=>'Хабаровск','region'=>'Хабаровский край'],
            '1169'=>['city'=>'Хабез','region'=>'Республика Карачаево-Черкессия'],
            '1170'=>['city'=>'Хадыженск','region'=>'Краснодарский край'],
            '1171'=>['city'=>'Ханты-Мансийск','region'=>'ХМАО ЮГРА'],
            '1172'=>['city'=>'Харабали','region'=>'Астраханская область'],
            '1173'=>['city'=>'Харовск','region'=>'Вологодская область'],
            '1174'=>['city'=>'Хасавюрт','region'=>'Республика Дагестан'],
            '1175'=>['city'=>'Хвалынск','region'=>'Саратовская область'],
            '1176'=>['city'=>'Хилок','region'=>'Забайкальский край'],
            '1177'=>['city'=>'Химки','region'=>'Московская область'],
            '1178'=>['city'=>'Хиславичи (ПГТ)','region'=>'Смоленская область'],
            '1179'=>['city'=>'Холм','region'=>'Новгородская область'],
            '1180'=>['city'=>'Холм-Жирковский (ПГТ)','region'=>'Смоленская область'],
            '1181'=>['city'=>'Холмск','region'=>'Сахалинская область'],
            '1182'=>['city'=>'Хотьково','region'=>'Московская область'],
            '1183'=>['city'=>'Цивильск','region'=>'Чувашская Республика'],
            '1184'=>['city'=>'Цимлянск','region'=>'Ростовская область'],
            '1185'=>['city'=>'Циолковский','region'=>'Амурская область'],
            '1186'=>['city'=>'Чаадаевка (ПГТ)','region'=>'Пензенская область'],
            '1187'=>['city'=>'Чадан','region'=>'Республика Тыва'],
            '1188'=>['city'=>'Чайковский','region'=>'Пермский край'],
            '1189'=>['city'=>'Чапаевск','region'=>'Самарская область'],
            '1190'=>['city'=>'Чапаевское','region'=>'Республика Карачаево-Черкессия'],
            '1191'=>['city'=>'Чаплыгин','region'=>'Липецкая область'],
            '1192'=>['city'=>'Чебаркуль','region'=>'Челябинская область'],
            '1193'=>['city'=>'Чебоксары','region'=>'Чувашская Республика'],
            '1194'=>['city'=>'Чегем','region'=>'Кабардино-Балкарская Республика'],
            '1195'=>['city'=>'Чекалин','region'=>'Тульская область'],
            '1196'=>['city'=>'Челябинск','region'=>'Челябинская область'],
            '1197'=>['city'=>'Чердынь','region'=>'Пермский край'],
            '1198'=>['city'=>'Черемхово','region'=>'Иркутская область'],
            '1199'=>['city'=>'Черепаново','region'=>'Новосибирская область'],
            '1200'=>['city'=>'Череповец','region'=>'Вологодская область'],
            '1201'=>['city'=>'Черкесск','region'=>'Республика Карачаево-Черкессия'],
            '1202'=>['city'=>'Чермен','region'=>'Республика Северная Осетия - Алания'],
            '1203'=>['city'=>'Чёрмоз','region'=>'Пермский край'],
            '1204'=>['city'=>'Черноголовка','region'=>'Московская область'],
            '1205'=>['city'=>'Черногорск','region'=>'Республика Хакасия'],
            '1206'=>['city'=>'Черноморское','region'=>'Автономная Республика Крым'],
            '1207'=>['city'=>'Чернушка','region'=>'Пермский край'],
            '1208'=>['city'=>'Черняховск','region'=>'Калининградская область'],
            '1209'=>['city'=>'Чехов','region'=>'Московская область'],
            '1210'=>['city'=>'Чикола','region'=>'Республика Северная Осетия - Алания'],
            '1211'=>['city'=>'Чири-Юрт (ПГТ)','region'=>'Чеченская Республика'],
            '1212'=>['city'=>'Чистополь','region'=>'Республика Татарстан'],
            '1213'=>['city'=>'Чита','region'=>'Забайкальский край'],
            '1214'=>['city'=>'Чкаловск','region'=>'Нижегородская область'],
            '1215'=>['city'=>'Чудово','region'=>'Новгородская область'],
            '1216'=>['city'=>'Чулым','region'=>'Новосибирская область'],
            '1217'=>['city'=>'Чусовой','region'=>'Пермский край'],
            '1218'=>['city'=>'Чухлома','region'=>'Костромская область'],
            '1219'=>['city'=>'Шагонар','region'=>'Республика Тыва'],
            '1220'=>['city'=>'Шадринск','region'=>'Курганская область'],
            '1221'=>['city'=>'Шали','region'=>'Чеченская Республика'],
            '1222'=>['city'=>'Шарыпово','region'=>'Красноярский край'],
            '1223'=>['city'=>'Шарья','region'=>'Костромская область'],
            '1224'=>['city'=>'Шатура','region'=>'Московская область'],
            '1225'=>['city'=>'Шахты','region'=>'Ростовская область'],
            '1226'=>['city'=>'Шахунья','region'=>'Нижегородская область'],
            '1227'=>['city'=>'Шацк','region'=>'Рязанская область'],
            '1228'=>['city'=>'Шебекино','region'=>'Белгородская область'],
            '1229'=>['city'=>'Шелехов','region'=>'Иркутская область'],
            '1230'=>['city'=>'Шемышейка (ПГТ)','region'=>'Пензенская область'],
            '1231'=>['city'=>'Шенкурск','region'=>'Архангельская область'],
            '1232'=>['city'=>'Шилка','region'=>'Забайкальский край'],
            '1233'=>['city'=>'Шимановск','region'=>'Амурская область'],
            '1234'=>['city'=>'Шипицыно','region'=>'Архангельская область'],
            '1235'=>['city'=>'Шиханы','region'=>'Саратовская область'],
            '1236'=>['city'=>'Шлиссельбург','region'=>'Ленинградская область'],
            '1237'=>['city'=>'Шумерля','region'=>'Чувашская Республика'],
            '1238'=>['city'=>'Шумиха','region'=>'Курганская область'],
            '1239'=>['city'=>'Шумячи (ПГТ)','region'=>'Смоленская область'],
            '1240'=>['city'=>'Шуя','region'=>'Ивановская область'],
            '1241'=>['city'=>'Щёкино','region'=>'Тульская область'],
            '1242'=>['city'=>'Щёлкино','region'=>'Автономная Республика Крым'],
            '1243'=>['city'=>'Щёлково','region'=>'Московская область'],
            '1244'=>['city'=>'Щигры','region'=>'Курская область'],
            '1245'=>['city'=>'Щучье','region'=>'Курганская область'],
            '1246'=>['city'=>'Электрогорск','region'=>'Московская область'],
            '1247'=>['city'=>'Электросталь','region'=>'Московская область'],
            '1248'=>['city'=>'Электроугли','region'=>'Московская область'],
            '1249'=>['city'=>'Элиста','region'=>'Республика Калмыкия'],
            '1250'=>['city'=>'Эльхотово','region'=>'Республика Северная Осетия - Алания'],
            '1251'=>['city'=>'Энгельс','region'=>'Саратовская область'],
            '1252'=>['city'=>'Энем (ПГТ)','region'=>'Республика Адыгея'],
            '1253'=>['city'=>'Эртиль','region'=>'Воронежская область'],
            '1254'=>['city'=>'Югорск','region'=>'ХМАО ЮГРА'],
            '1255'=>['city'=>'Южа','region'=>'Ивановская область'],
            '1256'=>['city'=>'Южно-Сахалинск','region'=>'Сахалинская область'],
            '1257'=>['city'=>'Южно-Сухокумск','region'=>'Республика Дагестан'],
            '1258'=>['city'=>'Южноуральск','region'=>'Челябинская область'],
            '1259'=>['city'=>'Юрга','region'=>'Кемеровская область'],
            '1260'=>['city'=>'Юрьевец','region'=>'Ивановская область'],
            '1261'=>['city'=>'Юрьев-Польский','region'=>'Владимирская область'],
            '1262'=>['city'=>'Юрюзань','region'=>'Челябинская область'],
            '1263'=>['city'=>'Юхнов','region'=>'Калужская область'],
            '1264'=>['city'=>'Яблоновский (ПГТ)','region'=>'Республика Адыгея'],
            '1265'=>['city'=>'Ядрин','region'=>'Чувашская Республика'],
            '1266'=>['city'=>'Якутск','region'=>'Республика Саха (Якутия)'],
            '1267'=>['city'=>'Ялта','region'=>'Автономная Республика Крым'],
            '1268'=>['city'=>'Ялуторовск','region'=>'Тюменская область'],
            '1269'=>['city'=>'Янаул','region'=>'Республика Башкортостан'],
            '1270'=>['city'=>'Яранск','region'=>'Кировская область'],
            '1271'=>['city'=>'Яровое','region'=>'Алтайский край'],
            '1272'=>['city'=>'Ярославль','region'=>'Ярославская область'],
            '1273'=>['city'=>'Ярцево','region'=>'Смоленская область'],
            '1274'=>['city'=>'Ясногорск','region'=>'Тульская область'],
            '1275'=>['city'=>'Ясный','region'=>'Оренбургская область'],
            '1276'=>['city'=>'Яхрома','region'=>'Московская область'],

        ];
        return $cities;
    }

    public static function getByCities()
    {
        $cities = [
            0 => ['', ''],
            '1' => ['city' => 'Барановичи', 'region' => 'Брестская область'],
            '2' => ['city' => 'Белыничи', 'region' => 'Могилевская область'],
            '3' => ['city' => 'Береза', 'region' => 'Брестская область'],
            '4' => ['city' => 'Березино', 'region' => 'Минская область'],
            '5' => ['city' => 'Бешенковичи', 'region' => 'Витебская область'],
            '6' => ['city' => 'Бобруйск', 'region' => 'Могилевская область'],
            '7' => ['city' => 'Бол.Берестовица', 'region' => 'Гродненская область'],
            '8' => ['city' => 'Большое Стиклево', 'region' => 'Минская область'],
            '9' => ['city' => 'Борисов', 'region' => 'Минская область'],
            '10' => ['city' => 'Брагин', 'region' => 'Гомельская область'],
            '11' => ['city' => 'Браслав', 'region' => 'Витебская область'],
            '12' => ['city' => 'Брест', 'region' => 'Брестская область'],
            '13' => ['city' => 'Буда-Кошелево', 'region' => 'Гомельская область'],
            '14' => ['city' => 'Быхов', 'region' => 'Могилевская область'],
            '15' => ['city' => 'Верхнедвинск', 'region' => 'Витебская область'],
            '16' => ['city' => 'Ветка', 'region' => 'Гомельская область'],
            '17' => ['city' => 'Вилейка', 'region' => 'Минская область'],
            '18' => ['city' => 'Витебск', 'region' => 'Витебская область'],
            '19' => ['city' => 'Волковыск', 'region' => 'Гродненская область'],
            '20' => ['city' => 'Воложин', 'region' => 'Минская область'],
            '21' => ['city' => 'Вороново', 'region' => 'Гродненская область'],
            '22' => ['city' => 'Ганцевичи', 'region' => 'Брестская область'],
            '23' => ['city' => 'Глубокое', 'region' => 'Витебская область'],
            '24' => ['city' => 'Глуск', 'region' => 'Могилевская область'],
            '25' => ['city' => 'Гомель', 'region' => 'Гомельская область'],
            '26' => ['city' => 'Горки', 'region' => 'Могилевская область'],
            '27' => ['city' => 'Городок', 'region' => 'Витебская область'],
            '28' => ['city' => 'Гродно', 'region' => 'Гродненская область'],
            '29' => ['city' => 'Дзержинск', 'region' => 'Минская область'],
            '30' => ['city' => 'Добруш', 'region' => 'Гомельская область'],
            '31' => ['city' => 'Докшицы', 'region' => 'Витебская область'],
            '32' => ['city' => 'Дрибин', 'region' => 'Могилевская область'],
            '33' => ['city' => 'Дрогичин', 'region' => 'Брестская область'],
            '34' => ['city' => 'Дубровно', 'region' => 'Витебская область'],
            '35' => ['city' => 'Дятлово', 'region' => 'Гродненская область'],
            '36' => ['city' => 'Ельск', 'region' => 'Гомельская область'],
            '37' => ['city' => 'Жабинка', 'region' => 'Брестская область'],
            '38' => ['city' => 'Житковичи', 'region' => 'Гомельская область'],
            '39' => ['city' => 'Жлобин', 'region' => 'Гомельская область'],
            '40' => ['city' => 'Жодино', 'region' => 'Минская область'],
            '41' => ['city' => 'Зельва', 'region' => 'Гродненская область'],
            '42' => ['city' => 'Иваново', 'region' => 'Брестская область'],
            '43' => ['city' => 'Ивацевичи', 'region' => 'Брестская область'],
            '44' => ['city' => 'Ивье', 'region' => 'Гродненская область'],
            '45' => ['city' => 'Калинковичи', 'region' => 'Гомельская область'],
            '46' => ['city' => 'Каменец', 'region' => 'Брестская область'],
            '47' => ['city' => 'Кировск', 'region' => 'Могилевская область'],
            '48' => ['city' => 'Клецк', 'region' => 'Минская область'],
            '49' => ['city' => 'Климовичи', 'region' => 'Могилевская область'],
            '50' => ['city' => 'Кличев', 'region' => 'Могилевская область'],
            '51' => ['city' => 'Кобрин', 'region' => 'Брестская область'],
            '52' => ['city' => 'Копыль', 'region' => 'Минская область'],
            '53' => ['city' => 'Кореличи', 'region' => 'Гродненская область'],
            '54' => ['city' => 'Корма', 'region' => 'Гомельская область'],
            '55' => ['city' => 'Костюковичи', 'region' => 'Могилевская область'],
            '56' => ['city' => 'Краснополье', 'region' => 'Могилевская область'],
            '57' => ['city' => 'Кричев', 'region' => 'Могилевская область'],
            '58' => ['city' => 'Круглое', 'region' => 'Могилевская область'],
            '59' => ['city' => 'Крупки', 'region' => 'Минская область'],
            '60' => ['city' => 'Лельчицы', 'region' => 'Гомельская область'],
            '61' => ['city' => 'Лепель', 'region' => 'Витебская область'],
            '62' => ['city' => 'Лида', 'region' => 'Гродненская область'],
            '63' => ['city' => 'Лиозно', 'region' => 'Витебская область'],
            '64' => ['city' => 'Логойск', 'region' => 'Минская область'],
            '65' => ['city' => 'Лоев', 'region' => 'Гомельская область'],
            '66' => ['city' => 'Лунинец', 'region' => 'Брестская область'],
            '67' => ['city' => 'Любань', 'region' => 'Минская область'],
            '68' => ['city' => 'Ляховичы', 'region' => 'Брестская область'],
            '69' => ['city' => 'Малорита', 'region' => 'Брестская область'],
            '70' => ['city' => 'Марьина Горка', 'region' => 'Минская область'],
            '71' => ['city' => 'Минск', 'region' => 'Минская область'],
            '72' => ['city' => 'Миоры', 'region' => 'Витебская область'],
            '73' => ['city' => 'Могилев', 'region' => 'Могилевская область'],
            '74' => ['city' => 'Мозырь', 'region' => 'Гомельская область'],
            '75' => ['city' => 'Молодечно', 'region' => 'Минская область'],
            '76' => ['city' => 'Мосты', 'region' => 'Гродненская область'],
            '77' => ['city' => 'Мстиславль', 'region' => 'Могилевская область'],
            '78' => ['city' => 'Мядель', 'region' => 'Минская область'],
            '79' => ['city' => 'Наровля', 'region' => 'Гомельская область'],
            '80' => ['city' => 'Несвиж', 'region' => 'Минская область'],
            '81' => ['city' => 'Новогрудок', 'region' => 'Гродненская область'],
            '82' => ['city' => 'Октябрьский', 'region' => 'Гомельская область'],
            '83' => ['city' => 'Орша', 'region' => 'Витебская область'],
            '84' => ['city' => 'Осиповичи', 'region' => 'Могилевская область'],
            '85' => ['city' => 'Островец', 'region' => 'Гродненская область'],
            '86' => ['city' => 'Ошмяны', 'region' => 'Гродненская область'],
            '87' => ['city' => 'Петриков', 'region' => 'Гомельская область'],
            '88' => ['city' => 'Пинск', 'region' => 'Брестская область'],
            '89' => ['city' => 'Полоцк', 'region' => 'Витебская область'],
            '90' => ['city' => 'Поставы', 'region' => 'Витебская область'],
            '91' => ['city' => 'Пружаны', 'region' => 'Брестская область'],
            '92' => ['city' => 'Речица', 'region' => 'Гомельская область'],
            '93' => ['city' => 'Рогачев', 'region' => 'Гомельская область'],
            '94' => ['city' => 'Россоны', 'region' => 'Витебская область'],
            '95' => ['city' => 'Светлогорск', 'region' => 'Гомельская область'],
            '96' => ['city' => 'Свислочь', 'region' => 'Гродненская область'],
            '97' => ['city' => 'Сенно', 'region' => 'Витебская область'],
            '98' => ['city' => 'Славгород', 'region' => 'Могилевская область'],
            '99' => ['city' => 'Слоним', 'region' => 'Гродненская область'],
            '100' => ['city' => 'Слуцк', 'region' => 'Минская область'],
            '101' => ['city' => 'Смолевичи', 'region' => 'Минская область'],
            '102' => ['city' => 'Сморгонь', 'region' => 'Гродненская область'],
            '103' => ['city' => 'Солигорск', 'region' => 'Минская область'],
            '104' => ['city' => 'Старые Дороги', 'region' => 'Минская область'],
            '105' => ['city' => 'Столбцы', 'region' => 'Минская область'],
            '106' => ['city' => 'Столин', 'region' => 'Брестская область'],
            '107' => ['city' => 'Толочин', 'region' => 'Витебская область'],
            '108' => ['city' => 'Узда', 'region' => 'Минская область'],
            '109' => ['city' => 'Ушачи', 'region' => 'Витебская область'],
            '110' => ['city' => 'Хойники', 'region' => 'Гомельская область'],
            '111' => ['city' => 'Хотимск', 'region' => 'Могилевская область'],
            '112' => ['city' => 'Чаусы', 'region' => 'Могилевская область'],
            '113' => ['city' => 'Чашники', 'region' => 'Витебская область'],
            '114' => ['city' => 'Червень', 'region' => 'Минская область'],
            '115' => ['city' => 'Чериков', 'region' => 'Могилевская область'],
            '116' => ['city' => 'Чечерск', 'region' => 'Гомельская область'],
            '117' => ['city' => 'Шарковщина', 'region' => 'Витебская область'],
            '118' => ['city' => 'Шклов', 'region' => 'Могилевская область'],
            '119' => ['city' => 'Шумилино', 'region' => 'Витебская область'],
            '120' => ['city' => 'Щучин', 'region' => 'Гродненская область'],
        ];

        return $cities;
    }

    public static function getBuildingTypes()
    {
        $types = [
            'possession' => 'Владение',
            'bldg' => 'Здание',
            'housing' => 'Корпус',
            'letter' => 'Литера',
            'construction' => 'Строение',
        ];

        return $types;
    }

    public function getBuilding(): ?string
    {
        return $this->building;
    }

    public function setBuilding(?string $building): self
    {
        $this->building = $building;

        return $this;
    }

    public function getRoom(): ?string
    {
        return $this->room;
    }

    public function setRoom(?string $room): self
    {
        $this->room = $room;

        return $this;
    }

    public function getBuildingType(): ?string
    {
        return $this->buildingType;
    }

    public function setBuildingType(?string $buildingType): self
    {
        $this->buildingType = $buildingType;

        return $this;
    }

    public function getLat(): ?string
    {
        return $this->lat;
    }

    public function setLat(?string $lat): self
    {
        $this->lat = $lat;

        return $this;
    }

    public function getLon(): ?string
    {
        return $this->lon;
    }

    public function setLon(?string $lon): self
    {
        $this->lon = $lon;

        return $this;
    }

    public function getFacilityType(): ?string
    {
        return $this->facilityType;
    }

    public function setFacilityType(?string $facilityType): self
    {
        $this->facilityType = $facilityType;

        return $this;
    }

}

